-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Máy chủ: 127.0.0.1:3308
-- Thời gian đã tạo: Th5 28, 2026 lúc 03:26 AM
-- Phiên bản máy phục vụ: 10.4.32-MariaDB
-- Phiên bản PHP: 8.0.30

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Cơ sở dữ liệu: `autocare_manager`
--

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `appointments`
--

CREATE TABLE `appointments` (
  `id` int(11) NOT NULL,
  `customer_id` int(11) DEFAULT NULL,
  `car_plate` varchar(20) DEFAULT NULL,
  `service_id` int(11) DEFAULT NULL,
  `employee_id` int(11) DEFAULT NULL,
  `appointment_date` datetime DEFAULT NULL,
  `total_price` decimal(15,2) DEFAULT NULL,
  `status` enum('Chờ xác nhận','Đã xác nhận','Đã hoàn thành','Đã bàn giao','Hủy lịch') DEFAULT NULL,
  `progress_percent` int(11) DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Đang đổ dữ liệu cho bảng `appointments`
--

INSERT INTO `appointments` (`id`, `customer_id`, `car_plate`, `service_id`, `employee_id`, `appointment_date`, `total_price`, `status`, `progress_percent`) VALUES
(53, 44, '19A-1233.44', 4, NULL, '2026-04-24 10:00:00', NULL, 'Đã bàn giao', 100),
(54, 44, '19A-1233.44', 5, NULL, '2026-04-24 10:00:00', NULL, 'Đã bàn giao', 100),
(55, 44, '19A-1233.44', 6, NULL, '2026-04-24 10:00:00', NULL, 'Đã bàn giao', 100),
(56, 44, '19A-1233.44', 7, NULL, '2026-04-24 10:00:00', NULL, 'Đã bàn giao', 100),
(57, 44, '19A-1233.44', 8, NULL, '2026-04-24 10:00:00', NULL, 'Đã bàn giao', 100),
(58, 44, '19A-1233.44', 9, NULL, '2026-04-24 10:00:00', NULL, 'Đã bàn giao', 100),
(59, 45, '21A_1444.34', 1, NULL, '2026-04-24 08:40:00', NULL, 'Đã bàn giao', 100),
(60, 45, '21A_1444.34', 2, NULL, '2026-04-24 08:40:00', NULL, 'Đã bàn giao', 100),
(61, 45, '21A_1444.34', 3, NULL, '2026-04-24 08:40:00', NULL, 'Đã bàn giao', 100),
(62, 45, '21A_1444.34', 4, NULL, '2026-04-24 08:40:00', NULL, 'Đã bàn giao', 100),
(63, 45, '21A_1444.34', 5, NULL, '2026-04-24 08:40:00', NULL, 'Đã bàn giao', 100),
(64, 45, '21A_1444.34', 6, NULL, '2026-04-24 08:40:00', NULL, 'Đã bàn giao', 100),
(65, 44, '31A-1234.98', 1, NULL, '2026-04-24 22:00:00', NULL, 'Đã bàn giao', 100),
(66, 44, '31A-1234.98', 2, NULL, '2026-04-24 22:00:00', NULL, 'Đã bàn giao', 100),
(67, 44, '31A-1234.98', 3, NULL, '2026-04-24 22:00:00', NULL, 'Đã bàn giao', 100),
(68, 44, '31A-1234.98', 4, NULL, '2026-04-24 22:00:00', NULL, 'Đã bàn giao', 100),
(69, 44, '31A-1234.98', 5, NULL, '2026-04-24 22:00:00', NULL, 'Đã bàn giao', 100),
(70, 44, '31A-1234.98', 6, NULL, '2026-04-24 22:00:00', NULL, 'Đã bàn giao', 100),
(71, 44, '31A-1234.98', 7, NULL, '2026-04-24 22:00:00', NULL, 'Đã bàn giao', 100),
(72, 44, '31A-1234.98', 8, NULL, '2026-04-24 22:00:00', NULL, 'Đã bàn giao', 100),
(73, 44, '31A-1234.98', 9, NULL, '2026-04-24 22:00:00', NULL, 'Đã bàn giao', 100),
(74, 46, '11A-221 77', 3, NULL, '2026-04-30 11:00:00', NULL, 'Đã bàn giao', 100),
(75, 46, '11A-221 77', 9, NULL, '2026-04-30 11:00:00', NULL, 'Đã bàn giao', 100),
(76, 47, '31A-231.11', 1, NULL, '2026-04-30 08:30:00', NULL, 'Đã bàn giao', 100),
(77, 47, '31A-231.11', 2, NULL, '2026-04-30 08:30:00', NULL, 'Đã bàn giao', 100),
(78, 47, '31A-231.11', 3, NULL, '2026-04-30 08:30:00', NULL, 'Đã bàn giao', 100),
(79, 36, '17A-123.11', 1, NULL, '2026-05-01 09:30:00', NULL, 'Đã bàn giao', 100),
(80, 36, '17A-123.11', 2, NULL, '2026-05-01 09:30:00', NULL, 'Đã bàn giao', 100),
(81, 36, '17A-123.11', 3, NULL, '2026-05-01 09:30:00', NULL, 'Đã bàn giao', 100),
(82, 36, '17A-123.11', 4, NULL, '2026-05-01 09:30:00', NULL, 'Đã bàn giao', 100),
(83, 36, '22A-123.11', 4, NULL, '2026-05-01 09:30:00', NULL, 'Đã bàn giao', 100),
(84, 36, '22A-123.11', 5, NULL, '2026-05-01 09:30:00', NULL, 'Đã bàn giao', 100),
(85, 36, '22A-123.11', 6, NULL, '2026-05-01 09:30:00', NULL, 'Đã bàn giao', 100),
(86, 36, '22A-221.12', 1, NULL, '2026-05-01 09:00:00', NULL, 'Đã bàn giao', 100),
(87, 36, '22A-221.12', 2, NULL, '2026-05-01 09:00:00', NULL, 'Đã bàn giao', 100),
(88, 36, '22A-221.12', 3, NULL, '2026-05-01 09:00:00', NULL, 'Đã bàn giao', 100),
(89, 36, '22A-221.12', 4, NULL, '2026-05-01 09:00:00', NULL, 'Đã bàn giao', 100),
(90, 36, '22A-221.12', 5, NULL, '2026-05-01 09:00:00', NULL, 'Đã bàn giao', 100),
(91, 36, '22A-221.12', 6, NULL, '2026-05-01 09:00:00', NULL, 'Đã bàn giao', 100),
(92, 36, '22A-221.12', 7, NULL, '2026-05-01 09:00:00', NULL, 'Hủy lịch', 0),
(93, 36, '22A-221.12', 8, NULL, '2026-05-01 09:00:00', NULL, 'Đã bàn giao', 100),
(94, 36, '30A-211.11', 7, NULL, '2026-05-01 12:00:00', NULL, 'Đã bàn giao', 100),
(95, 36, '30A-211.11', 8, NULL, '2026-05-01 12:00:00', NULL, 'Hủy lịch', 0),
(96, 36, '30A-211.11', 9, NULL, '2026-05-01 12:00:00', NULL, 'Đã bàn giao', 100),
(97, 36, '30A-211.11', 10, NULL, '2026-05-01 12:00:00', NULL, 'Đã bàn giao', 100),
(98, 36, '30A-211.11', 13, NULL, '2026-05-01 12:00:00', NULL, 'Đã bàn giao', 100),
(99, 36, '22A-221.22', 1, NULL, '2026-05-02 12:00:00', NULL, 'Đã bàn giao', 100),
(100, 36, '22A-221.22', 2, NULL, '2026-05-02 12:00:00', NULL, 'Đã bàn giao', 100),
(101, 36, '22A-221.22', 3, NULL, '2026-05-02 12:00:00', NULL, 'Đã bàn giao', 100),
(102, 36, '22A-221.22', 4, NULL, '2026-05-02 12:00:00', NULL, 'Đã bàn giao', 100),
(103, 36, '22A-221.22', 5, NULL, '2026-05-02 12:00:00', NULL, 'Đã bàn giao', 100),
(104, 36, '22A-221.22', 6, NULL, '2026-05-02 12:00:00', NULL, 'Đã bàn giao', 100),
(105, 36, '23B-213.44', 4, NULL, '2026-05-02 09:30:00', NULL, 'Đã bàn giao', 100),
(106, 36, '23B-213.44', 5, NULL, '2026-05-02 09:30:00', NULL, 'Đã bàn giao', 100),
(107, 36, '23B-213.44', 13, NULL, '2026-05-02 09:30:00', NULL, 'Đã bàn giao', 100),
(108, 36, '23B-213.44', 14, NULL, '2026-05-02 09:30:00', NULL, 'Đã bàn giao', 100),
(109, 36, '21A-211.45', 1, NULL, '2026-05-02 09:00:00', NULL, 'Đã bàn giao', 100),
(110, 36, '21A-211.45', 2, NULL, '2026-05-02 09:00:00', NULL, 'Đã bàn giao', 100),
(111, 36, '21A-211.45', 3, NULL, '2026-05-02 09:00:00', NULL, 'Đã bàn giao', 100),
(112, 36, '21A-211.45', 4, NULL, '2026-05-02 09:00:00', NULL, 'Đã bàn giao', 100),
(113, 36, '21A-211.45', 6, NULL, '2026-05-02 09:00:00', NULL, 'Đã bàn giao', 100),
(114, 36, '21A-211.45', 7, NULL, '2026-05-02 09:00:00', NULL, 'Đã bàn giao', 100),
(115, 36, '21A-211.45', 10, NULL, '2026-05-02 09:00:00', NULL, 'Đã bàn giao', 100),
(116, 36, '21A-211.45', 11, NULL, '2026-05-02 09:00:00', NULL, 'Đã bàn giao', 100),
(117, 36, '21A-211.45', 12, NULL, '2026-05-02 09:00:00', NULL, 'Đã bàn giao', 100),
(118, 48, '23A-212.11', 2, NULL, '2026-05-04 09:00:00', NULL, 'Đã bàn giao', 100),
(119, 48, '23A-212.11', 3, NULL, '2026-05-04 09:00:00', NULL, 'Đã bàn giao', 100),
(120, 48, '23A-212.11', 4, NULL, '2026-05-04 09:00:00', NULL, 'Đã bàn giao', 100),
(121, 48, '23A-212.11', 5, NULL, '2026-05-04 09:00:00', NULL, 'Đã bàn giao', 100),
(122, 48, '23A-212.11', 6, NULL, '2026-05-04 09:00:00', NULL, 'Đã bàn giao', 100),
(123, 48, '23A-212.11', 7, NULL, '2026-05-04 09:00:00', NULL, 'Đã bàn giao', 100),
(124, 48, '23A-212.11', 8, NULL, '2026-05-04 09:00:00', NULL, 'Đã bàn giao', 100),
(125, 48, '23A-212.11', 9, NULL, '2026-05-04 09:00:00', NULL, 'Đã bàn giao', 100),
(126, 48, '23A-212.11', 10, NULL, '2026-05-04 09:00:00', NULL, 'Đã bàn giao', 100),
(127, 48, '23A-212.11', 11, NULL, '2026-05-04 09:00:00', NULL, 'Đã bàn giao', 100),
(128, 48, '23A-212.11', 12, NULL, '2026-05-04 09:00:00', NULL, 'Đã bàn giao', 100),
(129, 48, '23A-212.11', 13, NULL, '2026-05-04 09:00:00', NULL, 'Đã bàn giao', 100),
(130, 49, '33A-321.11', 4, NULL, '2026-05-04 09:00:00', NULL, 'Đã bàn giao', 100),
(131, 49, '33A-321.11', 5, NULL, '2026-05-04 09:00:00', NULL, 'Đã bàn giao', 100),
(132, 49, '33A-321.11', 6, NULL, '2026-05-04 09:00:00', NULL, 'Đã bàn giao', 100),
(133, 49, '33A-321.11', 7, NULL, '2026-05-04 09:00:00', NULL, 'Đã bàn giao', 100),
(134, 49, '33A-321.11', 8, NULL, '2026-05-04 09:00:00', NULL, 'Đã bàn giao', 100),
(135, 49, '33A-321.11', 9, NULL, '2026-05-04 09:00:00', NULL, 'Đã bàn giao', 100),
(136, 49, '33A-321.11', 10, NULL, '2026-05-04 09:00:00', NULL, 'Đã bàn giao', 100),
(137, 49, '33A-321.11', 11, NULL, '2026-05-04 09:00:00', NULL, 'Đã bàn giao', 100),
(138, 36, '22A-231.44', 2, NULL, '2026-05-06 09:00:00', NULL, 'Đã bàn giao', 100),
(139, 36, '22A-231.44', 3, NULL, '2026-05-06 09:00:00', NULL, 'Đã bàn giao', 100),
(140, 36, '22A-231.44', 4, NULL, '2026-05-06 09:00:00', NULL, 'Đã bàn giao', 100),
(141, 36, '22A-231.44', 5, NULL, '2026-05-06 09:00:00', NULL, 'Đã bàn giao', 100),
(142, 36, '22A-231.44', 6, NULL, '2026-05-06 09:00:00', NULL, 'Đã bàn giao', 100),
(143, 36, '22A-231.44', 7, NULL, '2026-05-06 09:00:00', NULL, 'Đã bàn giao', 100),
(144, 36, '22A-231.44', 8, NULL, '2026-05-06 09:00:00', NULL, 'Đã bàn giao', 100),
(145, 36, '22A-231.44', 9, NULL, '2026-05-06 09:00:00', NULL, 'Đã bàn giao', 100),
(146, 36, '22A-231.44', 10, NULL, '2026-05-06 09:00:00', NULL, 'Đã bàn giao', 100),
(147, 36, '22A-231.44', 2, NULL, '2026-05-06 09:00:00', NULL, 'Đã bàn giao', 100),
(148, 36, '22A-231.44', 3, NULL, '2026-05-06 09:00:00', NULL, 'Hủy lịch', 0),
(149, 36, '22A-231.44', 4, NULL, '2026-05-06 09:00:00', NULL, 'Đã bàn giao', 100),
(150, 36, '22A-231.44', 5, NULL, '2026-05-06 09:00:00', NULL, 'Hủy lịch', 0),
(151, 36, '22A-231.44', 6, NULL, '2026-05-06 09:00:00', NULL, 'Hủy lịch', 0),
(152, 36, '22A-231.44', 7, NULL, '2026-05-06 09:00:00', NULL, 'Hủy lịch', 0),
(153, 36, '22A-231.44', 8, NULL, '2026-05-06 09:00:00', NULL, 'Hủy lịch', 0),
(154, 36, '22A-231.44', 9, NULL, '2026-05-06 09:00:00', NULL, 'Hủy lịch', 0),
(155, 50, '20-2311.11', NULL, NULL, '2026-05-06 08:00:00', NULL, 'Đã bàn giao', 100),
(156, 36, '22A-123.45', NULL, NULL, '2026-05-07 07:00:00', NULL, 'Đã bàn giao', 100),
(157, 51, '21A-212.44', NULL, NULL, '2026-05-07 08:00:00', NULL, 'Đã bàn giao', 100),
(158, 51, '24A-211.21', NULL, NULL, '2026-05-08 08:00:00', NULL, 'Đã bàn giao', 100),
(159, 52, '22A-212.33', NULL, NULL, '2026-05-08 23:00:00', NULL, 'Đã bàn giao', 100),
(160, 53, '24A-221.33', NULL, NULL, '2026-05-08 08:00:00', NULL, 'Đã bàn giao', 100),
(161, 54, '22A-345.67', NULL, NULL, '2026-05-08 08:00:00', NULL, 'Đã bàn giao', 100),
(162, 55, '66A-666.66', NULL, NULL, '2026-05-09 09:00:00', NULL, 'Đã bàn giao', 100),
(163, 56, '77A-777.77', NULL, NULL, '2026-05-09 09:00:00', NULL, 'Đã bàn giao', 100),
(164, 54, '11A-012-11', NULL, NULL, '2026-05-11 08:00:00', NULL, 'Đã bàn giao', 100),
(165, 57, '22A-212.21', NULL, NULL, '2026-05-11 09:00:00', NULL, 'Đã bàn giao', 100),
(166, 57, '22B-211.22', NULL, NULL, '2026-05-11 09:00:00', NULL, 'Đã bàn giao', 100),
(167, 54, '11A-111.11', NULL, NULL, '2026-05-11 09:00:00', NULL, 'Đã bàn giao', 100),
(168, 54, '11B-111.11', NULL, NULL, '2026-05-11 08:00:00', NULL, 'Đã bàn giao', 100),
(169, 57, '22A-221.11', NULL, NULL, '2026-05-11 12:00:00', NULL, 'Đã bàn giao', 100),
(170, 58, '33B-333.33', NULL, NULL, '2026-05-11 09:00:00', NULL, 'Đã bàn giao', 100),
(171, 59, '22A-212.22', NULL, NULL, '2026-05-11 09:00:00', NULL, 'Đã bàn giao', 100),
(172, 60, '43A-212.44', NULL, NULL, '2026-05-11 09:00:00', NULL, 'Đã bàn giao', 100),
(173, 36, '22A-112.11', NULL, NULL, '2026-05-11 09:00:00', NULL, 'Đã xác nhận', 0);

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `appointment_materials`
--

CREATE TABLE `appointment_materials` (
  `id` int(11) NOT NULL,
  `appointment_id` int(11) NOT NULL,
  `service_id` int(11) NOT NULL,
  `product_id` int(11) NOT NULL,
  `quantity_used` decimal(10,2) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Đang đổ dữ liệu cho bảng `appointment_materials`
--

INSERT INTO `appointment_materials` (`id`, `appointment_id`, `service_id`, `product_id`, `quantity_used`) VALUES
(1, 156, 10, 3, 1.00),
(2, 156, 10, 3, 2.00),
(3, 156, 10, 3, 2.00),
(4, 156, 10, 3, 2.00),
(5, 156, 10, 17, 1.00),
(6, 156, 10, 19, 1.00),
(7, 156, 10, 3, 2.00),
(8, 156, 10, 17, 1.00),
(9, 156, 10, 19, 1.00),
(10, 156, 10, 3, 2.00),
(11, 156, 10, 17, 1.00),
(12, 156, 10, 19, 1.00),
(13, 156, 10, 3, 2.00),
(14, 156, 10, 17, 1.00),
(15, 156, 10, 19, 1.00),
(16, 156, 10, 3, 2.00),
(17, 156, 10, 17, 1.00),
(18, 156, 10, 19, 1.00),
(19, 156, 10, 3, 2.00),
(20, 156, 10, 17, 1.00),
(21, 156, 10, 19, 1.00),
(22, 156, 10, 3, 2.00),
(23, 156, 10, 17, 1.00),
(24, 156, 10, 19, 1.00),
(25, 156, 10, 3, 2.00),
(26, 156, 10, 17, 1.00),
(27, 156, 10, 19, 1.00),
(28, 156, 10, 3, 2.00),
(29, 156, 10, 17, 1.00),
(30, 156, 10, 19, 1.00),
(31, 156, 10, 3, 2.00),
(32, 156, 10, 17, 1.00),
(33, 156, 10, 19, 1.00),
(34, 156, 10, 3, 2.00),
(35, 156, 10, 17, 1.00),
(36, 156, 10, 19, 1.00),
(37, 156, 10, 3, 2.00),
(38, 156, 10, 17, 1.00),
(39, 156, 10, 19, 1.00),
(40, 156, 10, 3, 2.00),
(41, 156, 10, 17, 1.00),
(42, 156, 10, 19, 1.00),
(43, 156, 10, 17, 3.00),
(44, 156, 10, 3, 2.00),
(45, 156, 10, 17, 3.00),
(46, 156, 10, 19, 1.00),
(47, 164, 1, 1, 1.00),
(48, 164, 1, 9, 1.00),
(49, 169, 3, 2, 1.00),
(50, 169, 3, 6, 1.00),
(51, 171, 2, 4, 4.00),
(52, 171, 2, 9, 1.00),
(53, 171, 2, 20, 2.00),
(54, 172, 2, 4, 4.00),
(55, 172, 2, 9, 1.00),
(56, 172, 2, 20, 2.00),
(57, 172, 21, 11, 1.00);

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `appointment_services`
--

CREATE TABLE `appointment_services` (
  `id` int(11) NOT NULL,
  `appointment_id` int(11) NOT NULL,
  `service_id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Đang đổ dữ liệu cho bảng `appointment_services`
--

INSERT INTO `appointment_services` (`id`, `appointment_id`, `service_id`) VALUES
(29, 53, 4),
(42, 54, 5),
(53, 55, 6),
(64, 56, 7),
(73, 57, 8),
(81, 58, 9),
(1, 59, 1),
(8, 60, 2),
(18, 61, 3),
(30, 62, 4),
(43, 63, 5),
(54, 64, 6),
(2, 65, 1),
(9, 66, 2),
(19, 67, 3),
(31, 68, 4),
(44, 69, 5),
(55, 70, 6),
(65, 71, 7),
(74, 72, 8),
(82, 73, 9),
(20, 74, 3),
(83, 75, 9),
(3, 76, 1),
(10, 77, 2),
(21, 78, 3),
(4, 79, 1),
(11, 80, 2),
(22, 81, 3),
(32, 82, 4),
(33, 83, 4),
(45, 84, 5),
(56, 85, 6),
(5, 86, 1),
(12, 87, 2),
(23, 88, 3),
(34, 89, 4),
(46, 90, 5),
(57, 91, 6),
(66, 92, 7),
(75, 93, 8),
(67, 94, 7),
(76, 95, 8),
(84, 96, 9),
(89, 97, 10),
(99, 98, 13),
(6, 99, 1),
(13, 100, 2),
(24, 101, 3),
(35, 102, 4),
(47, 103, 5),
(58, 104, 6),
(36, 105, 4),
(48, 106, 5),
(100, 107, 13),
(102, 108, 14),
(7, 109, 1),
(14, 110, 2),
(25, 111, 3),
(37, 112, 4),
(59, 113, 6),
(68, 114, 7),
(90, 115, 10),
(94, 116, 11),
(97, 117, 12),
(15, 118, 2),
(26, 119, 3),
(38, 120, 4),
(49, 121, 5),
(60, 122, 6),
(69, 123, 7),
(77, 124, 8),
(85, 125, 9),
(91, 126, 10),
(95, 127, 11),
(98, 128, 12),
(101, 129, 13),
(39, 130, 4),
(50, 131, 5),
(61, 132, 6),
(70, 133, 7),
(78, 134, 8),
(86, 135, 9),
(92, 136, 10),
(96, 137, 11),
(16, 138, 2),
(27, 139, 3),
(40, 140, 4),
(51, 141, 5),
(62, 142, 6),
(71, 143, 7),
(79, 144, 8),
(87, 145, 9),
(93, 146, 10),
(17, 147, 2),
(28, 148, 3),
(41, 149, 4),
(52, 150, 5),
(63, 151, 6),
(72, 152, 7),
(80, 153, 8),
(88, 154, 9),
(129, 155, 4),
(130, 155, 5),
(138, 156, 7),
(132, 156, 9),
(133, 156, 10),
(134, 156, 11),
(150, 157, 3),
(151, 157, 4),
(152, 157, 5),
(153, 157, 6),
(156, 158, 2),
(157, 158, 3),
(158, 158, 4),
(167, 159, 1),
(168, 159, 2),
(169, 159, 3),
(170, 159, 4),
(171, 159, 5),
(172, 159, 6),
(173, 159, 7),
(174, 159, 8),
(175, 159, 9),
(176, 159, 10),
(177, 159, 11),
(178, 159, 12),
(179, 159, 13),
(180, 159, 14),
(181, 159, 15),
(182, 159, 16),
(183, 159, 17),
(184, 159, 18),
(185, 159, 19),
(186, 159, 20),
(187, 159, 21),
(188, 159, 22),
(189, 159, 23),
(193, 160, 1),
(194, 160, 2),
(195, 160, 3),
(196, 160, 4),
(197, 160, 5),
(198, 160, 6),
(199, 160, 7),
(200, 160, 8),
(201, 160, 9),
(204, 161, 1),
(205, 161, 2),
(206, 161, 3),
(207, 161, 4),
(208, 161, 5),
(209, 161, 6),
(210, 161, 7),
(211, 161, 8),
(212, 161, 9),
(213, 161, 10),
(214, 161, 11),
(215, 161, 12),
(216, 161, 13),
(217, 161, 14),
(218, 161, 15),
(219, 161, 16),
(220, 161, 17),
(221, 161, 18),
(222, 161, 19),
(223, 161, 20),
(224, 161, 21),
(225, 161, 22),
(226, 161, 23),
(238, 162, 4),
(239, 162, 5),
(240, 162, 6),
(241, 162, 7),
(242, 162, 8),
(243, 162, 9),
(244, 163, 2),
(245, 163, 3),
(246, 163, 4),
(247, 163, 5),
(248, 163, 12),
(249, 163, 13),
(252, 164, 1),
(253, 164, 5),
(254, 164, 6),
(255, 164, 7),
(257, 165, 5),
(258, 165, 6),
(259, 165, 7),
(260, 165, 9),
(262, 166, 2),
(263, 166, 3),
(264, 166, 6),
(266, 167, 2),
(267, 167, 3),
(268, 167, 4),
(270, 168, 3),
(271, 168, 4),
(272, 168, 9),
(274, 169, 3),
(275, 169, 5),
(276, 169, 6),
(277, 169, 9),
(279, 170, 7),
(280, 170, 8),
(281, 170, 9),
(282, 170, 10),
(286, 171, 2),
(287, 171, 3),
(288, 171, 4),
(290, 172, 2),
(291, 172, 21),
(293, 173, 5),
(294, 173, 6),
(295, 173, 10);

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `cars`
--

CREATE TABLE `cars` (
  `plate_number` varchar(20) NOT NULL,
  `brand` varchar(50) DEFAULT NULL,
  `model` varchar(50) DEFAULT NULL,
  `year` int(11) DEFAULT NULL,
  `customer_id` int(11) DEFAULT NULL,
  `last_service` date DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Đang đổ dữ liệu cho bảng `cars`
--

INSERT INTO `cars` (`plate_number`, `brand`, `model`, `year`, `customer_id`, `last_service`) VALUES
('11A-012-11', 'a', 'a', 2024, 54, NULL),
('11A-111.11', '1', '1', 2024, 54, NULL),
('11A-221 77', 'kia', 'kai', 2024, 46, NULL),
('11B-111.11', '1', '1', 1999, 54, NULL),
('17A-123.11', 'kai', 'kia', 2019, 36, NULL),
('19A-1233.44', 'toyota', 'drem', 2019, 44, NULL),
('20-2311.11', 'kai', 'kai', 2021, 50, NULL),
('20A-123.11', NULL, NULL, NULL, 36, NULL),
('21A_1444.34', 'ff', 'ff', 2015, 45, NULL),
('21A-123.45', NULL, NULL, NULL, 37, NULL),
('21A-211.45', 'kia', 'kai', 2027, 36, NULL),
('21A-212.44', 'honda', 'honda', 2021, 51, NULL),
('22A-112.11', 'kia', 'kia', 2023, 36, NULL),
('22A-123.11', 'kia', 'kia', 2012, 36, NULL),
('22A-123.45', 'honda', 'honda', 2021, 36, NULL),
('22A-212.21', '2', '2', 2022, 57, NULL),
('22A-212.22', '2', '1', 2012, 59, NULL),
('22A-212.33', 'Honda', 'Honda', 2024, 52, NULL),
('22A-221.11', '2', '2', 2022, 57, NULL),
('22A-221.12', 'aa', 'aa', 2022, 36, NULL),
('22A-221.22', 'jinda', 'honda', 2018, 36, NULL),
('22A-231.44', 'toyota', 'toyota', 2021, 36, NULL),
('22A-345.67', 'Vip', 'tim', 2022, 54, NULL),
('22B-211.22', '2', '2', 2022, 57, NULL),
('23A-212.11', 'kia', 'kia', 2018, 48, NULL),
('23A1111', 'dja', 'aksd', 2047, 7, NULL),
('23B-213.44', 'honda', 'honda', 2013, 36, NULL),
('24A-211.21', 'Toyota', 'honda', 2012, 51, NULL),
('24A-221.33', 'kia', 'kia', 2024, 53, NULL),
('24A12345', 'hh', 'aa', 2014, 8, NULL),
('30A 2222', 'lambo', 'ad', 3000, 4, NULL),
('30A-123.45', NULL, NULL, NULL, 36, NULL),
('30A-1234.11', 'Hina', 'vivo', 2016, 44, NULL),
('30A-211.11', 'kai', 'kia', 2021, 36, NULL),
('30A1111', 'kia', 'oo', 2012, 4, NULL),
('30A1234567', NULL, NULL, NULL, 10, NULL),
('30A3333', 'das', 'jj', 2941, 8, NULL),
('30Akasf', NULL, NULL, NULL, 29, NULL),
('31A-1234.98', 'aa', 'aa', 2019, 44, NULL),
('31A-231.11', 'kia', 'kia', 2021, 47, NULL),
('31A0912', NULL, NULL, NULL, 31, NULL),
('33A-321.11', 'Honda', 'Honda', 2012, 49, NULL),
('33B-333.33', '3', '3', 2023, 58, NULL),
('392131', 'djas', 'dja', 0, 9, NULL),
('43A-212.44', '22', '22', 2026, 60, NULL),
('66A-666.66', 'KAI', 'KIA', 2024, 55, NULL),
('77A-777.77', '7', '7', 2024, 56, NULL),
('92384', NULL, NULL, NULL, 30, NULL);

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `customers`
--

CREATE TABLE `customers` (
  `id` int(11) NOT NULL,
  `full_name` varchar(100) NOT NULL,
  `phone` varchar(15) NOT NULL,
  `email` varchar(100) DEFAULT NULL,
  `address` text DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `visit_count` int(11) DEFAULT 1
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Đang đổ dữ liệu cho bảng `customers`
--

INSERT INTO `customers` (`id`, `full_name`, `phone`, `email`, `address`, `created_at`, `visit_count`) VALUES
(1, 'Nguyễn Văn An', '0901234567', 'an.nguyen@email.com', NULL, '2026-04-14 10:43:21', 0),
(2, 'Trần Thị Bình', '0912345678', 'binh.tran@email.com', NULL, '2026-04-14 10:43:21', 0),
(4, 'Thao', '01234', 'abc', NULL, '2026-04-16 18:38:57', 2),
(7, 'admin', '01234578', 'abc', NULL, '2026-04-16 18:59:08', 1),
(8, 'admin', '012345678', 'abc', NULL, '2026-04-16 19:00:24', 2),
(9, 'asd', '0768456', '', NULL, '2026-04-16 19:03:26', 1),
(10, 'avcs', '', NULL, NULL, '2026-04-17 08:27:28', 1),
(29, 'abd', '019414', NULL, NULL, '2026-04-23 12:57:39', 1),
(30, 'abc', '09124', NULL, NULL, '2026-04-23 12:59:01', 1),
(31, 'abc', '123456789', NULL, NULL, '2026-04-23 13:09:53', 1),
(36, 'abd', '0123456789', 'abc@gmail.com', NULL, '2026-04-23 14:07:20', 1),
(37, 'abc', '0123356789', NULL, NULL, '2026-04-23 14:13:13', 1),
(44, 'abcdfg', '0987654321', NULL, NULL, '2026-04-24 07:55:50', 1),
(45, 'hdah', '0123456888', NULL, NULL, '2026-04-24 09:33:40', 1),
(46, 'aaa', '01234567788', NULL, NULL, '2026-04-29 17:26:59', 1),
(47, 'aaa', '00000000000', NULL, NULL, '2026-04-29 19:25:47', 1),
(48, 'abcd', '012345788', 'abcd@gamil.com', NULL, '2026-05-04 09:21:45', 1),
(49, 'abcde', '0231456789', 'abcde@gamil.com', NULL, '2026-05-04 09:38:46', 1),
(50, 'avc', '0223456789', 'abc@gmail.com', NULL, '2026-05-06 09:53:47', 1),
(51, 'abcd', '012345789', 'abcd@gmail.com', NULL, '2026-05-07 04:26:20', 1),
(52, 'VVIP', '098754321', 'VVIP@gamil.com', NULL, '2026-05-08 09:18:36', 1),
(53, 'VVIP', '098754322', 'VVIP@gmail.com', NULL, '2026-05-08 09:24:20', 1),
(54, '1', '011111111', '1@gmail.com', NULL, '2026-05-08 09:27:16', 1),
(55, 'Vip6', '0666666666', 'vip6', NULL, '2026-05-09 04:35:10', 1),
(56, 'Vip7', '077777777', 'Vip7@gmail.com', NULL, '2026-05-09 04:38:08', 1),
(57, '2', '022222222', '2@gmail.com', NULL, '2026-05-11 09:16:47', 1),
(58, '3', '033333333', '3@gmail.com', NULL, '2026-05-11 09:56:07', 1),
(59, '2', '0222222222', '2@gmail.com', NULL, '2026-05-11 10:09:00', 1),
(60, '22', '023456789', '22@gmail.com', NULL, '2026-05-11 10:13:07', 1);

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `employees`
--

CREATE TABLE `employees` (
  `id` int(11) NOT NULL,
  `employee_code` varchar(20) NOT NULL,
  `full_name` varchar(100) NOT NULL,
  `phone` varchar(15) DEFAULT NULL,
  `cccd` varchar(20) DEFAULT NULL,
  `email` varchar(100) DEFAULT NULL,
  `position` varchar(50) DEFAULT NULL,
  `department` varchar(50) DEFAULT NULL,
  `salary` decimal(15,2) DEFAULT NULL,
  `hire_date` date DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Đang đổ dữ liệu cho bảng `employees`
--

INSERT INTO `employees` (`id`, `employee_code`, `full_name`, `phone`, `cccd`, `email`, `position`, `department`, `salary`, `hire_date`) VALUES
(1, 'NV001', 'Trần Văn Minh', '0901111111', '1111111111', 'minh.tran@autocare.vn', 'Kỹ thuật viên trưởng', 'Kỹ thuật', 15000000.00, '2020-03-15'),
(2, 'NV002', 'Nguyễn Thị Lan', '0902222222', '2222222', 'lan.nguyen@autocare.vn', 'Nhân viên tư vấn', 'Kinh doanh', 10000000.00, '2021-06-20'),
(3, 'NV003', 'Lê Hoàng Nam', '0903333333', '0192015715', 'nam.le@autocare.vn', 'Kỹ thuật viên', 'Kỹ thuật', 12000000.00, '2022-01-10'),
(4, 'NV004', 'Phạm Minh Tâm', '0904444444', '014148', 'tam.pham@autocare.vn', 'Kế toán', 'Hành chính', 11000000.00, '2019-11-05'),
(5, 'NV005', 'Võ Văn Đức', '0905555555', '09148241', 'duc.vo@autocare.vn', 'Cố vấn dịch vụ', 'Kinh doanh', 13000000.00, '2023-02-28'),
(6, 'NV006', 'Hoàng Anh Tuấn', '0906666666', '09142418', 'tuan.hoang@autocare.vn', 'Kỹ thuật viên điện', 'Kỹ thuật', 12500000.00, '2022-08-12'),
(7, 'NV007', 'Bùi Kim Oanh', '0907777777', '9014821', 'oanh.bui@autocare.vn', 'Lễ tân', 'Hành chính', 8500000.00, '2023-05-15'),
(8, 'NV008', 'Đỗ Mạnh Hùng', '0908888888', '11111', 'hung.do@autocare.vn', 'Nhân viên kho', 'Kỹ thuật', 9500000.00, '2021-12-01'),
(9, 'NV009', 'Ngô Thanh Hải', '0909999999', '049124', 'hai.ngo@autocare.vn', 'Chuyên viên Marketing', 'Kinh doanh', 14000000.00, '2020-09-25'),
(10, 'NV010', 'Lý Thu Thảo', '0901010101', '091421', 'thao.ly@autocare.vn', 'Trưởng phòng nhân sự', 'Hành chính', 18000000.00, '2018-04-10'),
(11, '2023', 'admin', '009874', '491258', 'abc@', 'Sếp tổng', 'Kỹ thuật', 5000000.00, '2026-04-17'),
(12, '0101', 'test', '123456', '123456', 'abc', 'lao coong', 'Kỹ thuật', 1000000.00, '2026-04-17');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `inventory`
--

CREATE TABLE `inventory` (
  `id` int(11) NOT NULL,
  `product_code` varchar(50) NOT NULL,
  `product_name` varchar(255) NOT NULL,
  `category` varchar(100) DEFAULT NULL,
  `brand` varchar(100) DEFAULT NULL,
  `stock_quantity` int(11) DEFAULT 0,
  `min_stock` int(11) DEFAULT 5,
  `unit` varchar(50) DEFAULT NULL,
  `price` decimal(15,2) DEFAULT 0.00,
  `location` varchar(100) DEFAULT NULL,
  `supplier` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Đang đổ dữ liệu cho bảng `inventory`
--

INSERT INTO `inventory` (`id`, `product_code`, `product_name`, `category`, `brand`, `stock_quantity`, `min_stock`, `unit`, `price`, `location`, `supplier`) VALUES
(1, 'NK001', 'Nhớt động cơ 5W-30', 'Phụ tùng', 'Castrol', 42, 20, 'Lít', 180000.00, 'Kệ A1', 'Đại lý Castrol VN'),
(2, 'PK001', 'Lọc gió động cơ', 'Phụ tùng', 'Denso', 34, 15, 'Cái', 120000.00, 'Kệ B2', 'Phụ tùng Denso'),
(3, 'PK002', 'Má phanh trước', 'Phụ tùng', 'Brembo', 50, 10, 'Bộ', 850000.00, 'Kệ C3', 'Brembo Việt Nam'),
(4, 'PK003', 'Lốp xe 195/65R15', 'Phụ tùng', 'Michelin', 10, 12, 'Cái', 1500000.00, 'Kho lốp', 'Michelin Sales'),
(5, 'PH001', 'Thảm lót sàn cao su', 'Phụ kiện', 'Generic', 45, 20, 'Bộ', 250000.00, 'Kệ D1', 'Phụ kiện Auto'),
(6, 'PH002', 'Nước hoa xe hơi', 'Phụ kiện', 'Areon', 15, 25, 'Chai', 80000.00, 'Kệ D2', 'Areon VN'),
(7, 'PK004', 'Ắc quy 12V 60Ah', 'Phụ tùng', 'Bosch', 12, 8, 'Cái', 1800000.00, 'Kệ E1', 'Bosch Power'),
(8, 'PH003', 'Camera hành trình', 'Phụ kiện', 'Viofo', 6, 10, 'Cái', 2500000.00, 'Kệ F1', 'Viofo Distribution'),
(9, 'NK002', 'Nước làm mát hồng', 'Phụ tùng', 'Toyota', 35, 15, 'Lít', 150000.00, 'Kệ A2', 'Toyota Spare Parts'),
(10, 'PK005', 'Bugi bạch kim', 'Phụ tùng', 'NGK', 96, 30, 'Cái', 95000.00, 'Kệ B1', 'NGK Việt Nam'),
(11, 'PH004', 'Bọc vô lăng da', 'Phụ kiện', 'Sparco', 20, 10, 'Cái', 450000.00, 'Kệ D3', 'Sparco Official'),
(12, 'PK006', 'Lọc dầu nhớt', 'Phụ tùng', 'Bosch', 100, 10, 'Cái', 110000.00, 'Kệ B3', 'Bosch Power'),
(13, 'PK007', 'Gạt mưa silicon', 'Phụ tùng', '3M', 58, 20, 'Bộ', 350000.00, 'Kệ C1', '3M Việt Nam'),
(14, 'PH005', 'Bơm lốp mini', 'Phụ kiện', 'Xiaomi', 12, 5, 'Cái', 750000.00, 'Kệ F2', 'Xiaomi Store'),
(15, 'PK008', 'Dây curoa tổng', 'Phụ tùng', 'Gates', 15, 5, 'Cái', 450000.00, 'Kệ E2', 'Gates Belt VN'),
(16, 'PH006', 'Tấm chắn nắng', 'Phụ kiện', 'Generic', 100, 30, 'Cái', 35000.00, 'Kho phụ kiện', 'Phụ kiện Auto'),
(17, 'PK009', 'Phuộc nhún trước', 'Phụ tùng', 'KYB', 2, 6, 'Bộ', 2200000.00, 'Kệ C4', 'KYB Việt Nam'),
(18, 'PH007', 'Giá đỡ điện thoại', 'Phụ kiện', 'Baseus', 30, 15, 'Cái', 150000.00, 'Kệ D4', 'Baseus VN'),
(19, 'NK003', 'Dầu phanh DOT 4', 'Phụ tùng', 'Total', 23, 10, 'Chai', 135000.00, 'Kệ A3', 'Total Energy'),
(20, 'PH008', 'Bộ dụng cụ cứu hộ', 'Phụ kiện', 'Michelin', 0, 5, 'Bộ', 1250000.00, 'Kệ F3', 'Michelin Sales');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `invoices`
--

CREATE TABLE `invoices` (
  `id` int(11) NOT NULL,
  `appointment_id` int(11) DEFAULT NULL,
  `customer_id` int(11) DEFAULT NULL,
  `total_amount` decimal(12,2) DEFAULT 0.00,
  `status` enum('Chưa thanh toán','Đã thanh toán','Thanh toán một phần') DEFAULT 'Chưa thanh toán',
  `created_at` datetime DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Đang đổ dữ liệu cho bảng `invoices`
--

INSERT INTO `invoices` (`id`, `appointment_id`, `customer_id`, `total_amount`, `status`, `created_at`) VALUES
(4, NULL, 44, 1000000.00, 'Đã thanh toán', '2026-04-24 15:19:41'),
(5, NULL, 44, 1000000.00, 'Đã thanh toán', '2026-04-24 15:32:49'),
(6, NULL, 44, 250000.00, 'Đã thanh toán', '2026-04-24 15:32:49'),
(7, 53, 44, 850000.00, 'Đã thanh toán', '2026-04-24 15:32:49'),
(8, 54, 44, 600000.00, 'Đã thanh toán', '2026-04-24 15:32:49'),
(9, 55, 44, 1500000.00, 'Đã thanh toán', '2026-04-24 15:32:49'),
(10, 56, 44, 2500000.00, 'Đã thanh toán', '2026-04-24 15:32:49'),
(11, 57, 44, 5500000.00, 'Đã thanh toán', '2026-04-24 15:32:49'),
(12, 58, 44, 1200000.00, 'Đã thanh toán', '2026-04-24 15:32:49'),
(13, 61, 45, 250000.00, 'Đã thanh toán', '2026-04-24 16:34:37'),
(14, 59, 45, 1000000.00, 'Đã thanh toán', '2026-04-24 16:34:49'),
(15, 60, 45, 1000000.00, 'Đã thanh toán', '2026-04-24 16:34:52'),
(16, 62, 45, 850000.00, 'Đã thanh toán', '2026-04-24 16:45:25'),
(17, 63, 45, 600000.00, 'Đã thanh toán', '2026-04-24 16:45:29'),
(18, 64, 45, 1500000.00, 'Đã thanh toán', '2026-04-24 16:51:42'),
(19, 65, 44, 1000000.00, 'Đã thanh toán', '2026-04-30 00:25:25'),
(20, 75, 46, 1200000.00, 'Đã thanh toán', '2026-04-30 00:27:18'),
(21, 74, 46, 250000.00, 'Đã thanh toán', '2026-04-30 00:51:13'),
(22, 66, 44, 1000000.00, 'Đã thanh toán', '2026-04-30 02:14:08'),
(23, 67, 44, 250000.00, 'Đã thanh toán', '2026-04-30 02:14:18'),
(24, 68, 44, 850000.00, 'Đã thanh toán', '2026-04-30 02:15:16'),
(25, 69, 44, 600000.00, 'Đã thanh toán', '2026-04-30 02:15:22'),
(26, 70, 44, 1500000.00, 'Đã thanh toán', '2026-04-30 02:15:28'),
(27, 71, 44, 2500000.00, 'Đã thanh toán', '2026-04-30 02:15:36'),
(28, 72, 44, 5500000.00, 'Đã thanh toán', '2026-04-30 02:19:13'),
(29, 73, 44, 1200000.00, 'Đã thanh toán', '2026-04-30 02:19:19'),
(30, 76, 47, 1000000.00, 'Đã thanh toán', '2026-04-30 02:26:10'),
(31, 77, 47, 1000000.00, 'Đã thanh toán', '2026-04-30 02:26:13'),
(32, 78, 47, 250000.00, 'Đã thanh toán', '2026-04-30 02:26:15'),
(33, 79, 36, 1000000.00, 'Đã thanh toán', '2026-05-01 00:03:59'),
(34, 80, 36, 1000000.00, 'Đã thanh toán', '2026-05-01 00:04:03'),
(35, 81, 36, 250000.00, 'Đã thanh toán', '2026-05-01 00:04:06'),
(36, 82, 36, 850000.00, 'Đã thanh toán', '2026-05-01 00:04:09'),
(37, 83, 36, 850000.00, 'Đã thanh toán', '2026-05-01 00:20:47'),
(38, 84, 36, 600000.00, 'Đã thanh toán', '2026-05-01 00:20:51'),
(39, 85, 36, 1500000.00, 'Đã thanh toán', '2026-05-01 00:21:43'),
(40, 86, 36, 1000000.00, 'Đã thanh toán', '2026-05-01 00:38:36'),
(41, 87, 36, 1000000.00, 'Đã thanh toán', '2026-05-01 00:38:40'),
(42, 88, 36, 250000.00, 'Đã thanh toán', '2026-05-01 00:58:40'),
(43, 89, 36, 850000.00, 'Đã thanh toán', '2026-05-01 00:58:45'),
(44, 90, 36, 600000.00, 'Đã thanh toán', '2026-05-01 00:58:51'),
(45, 91, 36, 1500000.00, 'Đã thanh toán', '2026-05-01 00:58:54'),
(46, 94, 36, 2500000.00, 'Đã thanh toán', '2026-05-01 01:15:02'),
(47, 96, 36, 1200000.00, 'Đã thanh toán', '2026-05-01 01:49:12'),
(48, 98, 36, 2500000.00, 'Đã thanh toán', '2026-05-01 01:57:23'),
(49, 93, 36, 5500000.00, 'Đã thanh toán', '2026-05-01 01:57:26'),
(50, 97, 36, 400000.00, 'Đã thanh toán', '2026-05-02 00:04:17'),
(51, 99, 36, 1000000.00, 'Đã thanh toán', '2026-05-02 00:08:57'),
(52, 100, 36, 1000000.00, 'Đã thanh toán', '2026-05-02 00:09:03'),
(53, 101, 36, 250000.00, 'Đã thanh toán', '2026-05-02 00:09:06'),
(54, 102, 36, 850000.00, 'Đã thanh toán', '2026-05-02 00:09:13'),
(55, 103, 36, 600000.00, 'Đã thanh toán', '2026-05-02 00:24:59'),
(56, 104, 36, 1500000.00, 'Đã thanh toán', '2026-05-02 00:25:03'),
(57, 106, 36, 600000.00, 'Đã thanh toán', '2026-05-02 01:44:38'),
(58, 107, 36, 2500000.00, 'Đã thanh toán', '2026-05-02 01:44:40'),
(59, 108, 36, 800000.00, 'Đã thanh toán', '2026-05-02 01:44:43'),
(60, 105, 36, 850000.00, 'Đã thanh toán', '2026-05-02 01:44:46'),
(61, 111, 36, 250000.00, 'Đã thanh toán', '2026-05-02 01:56:38'),
(62, 113, 36, 1500000.00, 'Đã thanh toán', '2026-05-02 01:56:51'),
(63, 115, 36, 400000.00, 'Đã thanh toán', '2026-05-02 01:56:56'),
(64, 109, 36, 1000000.00, 'Đã thanh toán', '2026-05-04 15:54:47'),
(65, 110, 36, 1000000.00, 'Đã thanh toán', '2026-05-04 16:00:32'),
(66, 112, 36, 850000.00, 'Đã thanh toán', '2026-05-04 16:08:23'),
(67, 116, 36, 100000.00, 'Đã thanh toán', '2026-05-04 16:09:02'),
(68, 117, 36, 300000.00, 'Đã thanh toán', '2026-05-04 16:09:05'),
(69, 114, 36, 2500000.00, 'Đã thanh toán', '2026-05-04 16:20:33'),
(70, 128, 48, 300000.00, 'Đã thanh toán', '2026-05-04 16:22:01'),
(71, 127, 48, 100000.00, 'Đã thanh toán', '2026-05-04 16:22:03'),
(72, 126, 48, 400000.00, 'Đã thanh toán', '2026-05-04 16:30:54'),
(73, 118, 48, 1000000.00, 'Đã thanh toán', '2026-05-04 16:31:01'),
(74, 119, 48, 250000.00, 'Đã thanh toán', '2026-05-04 16:31:55'),
(75, 120, 48, 850000.00, 'Đã thanh toán', '2026-05-04 16:31:58'),
(76, 122, 48, 1500000.00, 'Đã thanh toán', '2026-05-04 16:32:37'),
(77, 123, 48, 2500000.00, 'Đã thanh toán', '2026-05-04 16:32:40'),
(78, 121, 48, 600000.00, 'Đã thanh toán', '2026-05-04 16:37:12'),
(79, 124, 48, 5500000.00, 'Đã thanh toán', '2026-05-04 16:37:18'),
(80, 125, 48, 1200000.00, 'Đã thanh toán', '2026-05-04 16:37:25'),
(81, 129, 48, 2500000.00, 'Đã thanh toán', '2026-05-04 16:37:47'),
(82, 137, 49, 100000.00, 'Đã thanh toán', '2026-05-04 16:38:57'),
(83, 130, 49, 850000.00, 'Đã thanh toán', '2026-05-04 16:39:04'),
(84, 131, 49, 600000.00, 'Đã thanh toán', '2026-05-04 16:47:20'),
(85, 134, 49, 5500000.00, 'Đã thanh toán', '2026-05-04 17:16:13'),
(86, 132, 49, 1500000.00, 'Đã thanh toán', '2026-05-04 17:18:47'),
(87, 136, 49, 400000.00, 'Đã thanh toán', '2026-05-06 16:14:51'),
(88, 133, 49, 2500000.00, 'Đã thanh toán', '2026-05-06 16:14:56'),
(89, 135, 49, 1200000.00, 'Đã thanh toán', '2026-05-06 16:15:03'),
(90, 138, 36, 1000000.00, 'Đã thanh toán', '2026-05-06 16:48:10'),
(91, 139, 36, 250000.00, 'Đã thanh toán', '2026-05-06 16:48:30'),
(92, 140, 36, 850000.00, 'Đã thanh toán', '2026-05-06 16:48:36'),
(93, 141, 36, 600000.00, 'Đã thanh toán', '2026-05-06 16:48:48'),
(94, 142, 36, 1500000.00, 'Đã thanh toán', '2026-05-06 16:49:34'),
(95, 143, 36, 2500000.00, 'Đã thanh toán', '2026-05-06 16:49:58'),
(96, 144, 36, 5500000.00, 'Đã thanh toán', '2026-05-06 16:50:41'),
(97, 145, 36, 1200000.00, 'Đã thanh toán', '2026-05-06 16:50:55'),
(98, 149, 36, 850000.00, 'Đã thanh toán', '2026-05-06 16:51:09'),
(99, 146, 36, 400000.00, 'Đã thanh toán', '2026-05-06 16:51:15'),
(100, 147, 36, 1000000.00, 'Đã thanh toán', '2026-05-06 16:51:32'),
(101, 155, 50, 1450000.00, 'Đã thanh toán', '2026-05-07 10:04:37'),
(102, 156, 36, 4200000.00, 'Đã thanh toán', '2026-05-07 10:36:29'),
(103, 158, 51, 2100000.00, 'Đã thanh toán', '2026-05-08 16:13:01'),
(104, 159, 52, 22350000.00, 'Đã thanh toán', '2026-05-08 16:19:06'),
(105, 160, 53, 14400000.00, 'Đã thanh toán', '2026-05-08 16:24:30'),
(106, 161, 54, 22350000.00, 'Đã thanh toán', '2026-05-08 16:27:29'),
(107, 157, 51, 0.00, 'Chưa thanh toán', '2026-05-09 11:16:47'),
(108, 162, 55, 12150000.00, 'Đã thanh toán', '2026-05-09 11:35:24'),
(109, 163, 56, 5500000.00, 'Đã thanh toán', '2026-05-09 11:38:36'),
(110, 164, 54, 5600000.00, 'Đã thanh toán', '2026-05-11 16:08:58'),
(111, 165, 57, 5800000.00, 'Đã thanh toán', '2026-05-11 16:16:59'),
(112, 166, 57, 2750000.00, 'Đã thanh toán', '2026-05-11 16:18:58'),
(113, 167, 54, 2100000.00, 'Đã thanh toán', '2026-05-11 16:29:49'),
(114, 168, 54, 2300000.00, 'Đã thanh toán', '2026-05-11 16:35:30'),
(115, 169, 57, 3550000.00, 'Đã thanh toán', '2026-05-11 16:40:08'),
(116, 170, 58, 9600000.00, 'Đã thanh toán', '2026-05-11 16:56:17'),
(117, 171, 59, 2100000.00, 'Đã thanh toán', '2026-05-11 17:09:15'),
(118, 172, 60, 1200000.00, 'Chưa thanh toán', '2026-05-11 17:13:30');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `invoice_items`
--

CREATE TABLE `invoice_items` (
  `id` int(11) NOT NULL,
  `invoice_id` int(11) DEFAULT NULL,
  `service_id` int(11) DEFAULT NULL,
  `service_name` varchar(255) DEFAULT NULL,
  `price` decimal(12,2) DEFAULT NULL,
  `quantity` int(11) DEFAULT 1
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Đang đổ dữ liệu cho bảng `invoice_items`
--

INSERT INTO `invoice_items` (`id`, `invoice_id`, `service_id`, `service_name`, `price`, `quantity`) VALUES
(4, 4, 1, 'Rửa Xe', 1000000.00, 1),
(5, 5, 2, 'Thay Lốp', 1000000.00, 1),
(6, 6, 3, 'Rửa xe chi tiết (Detailing)', 250000.00, 1),
(7, 7, 4, 'Vệ sinh khoang máy', 850000.00, 1),
(8, 8, 5, 'Tẩy ố kính & Phủ Nano', 600000.00, 1),
(9, 9, 6, 'Vệ sinh nội thất chuyên sâu', 1500000.00, 1),
(10, 10, 7, 'Đánh bóng hiệu chỉnh sơn', 2500000.00, 1),
(11, 11, 8, 'Phủ Ceramic bảo vệ sơn', 5500000.00, 1),
(12, 12, 9, 'Thay dầu & Lọc nhớt', 1200000.00, 1),
(13, 13, 3, 'Rửa xe chi tiết (Detailing)', 250000.00, 1),
(14, 14, 1, 'Rửa Xe', 1000000.00, 1),
(15, 15, 2, 'Thay Lốp', 1000000.00, 1),
(16, 16, 4, 'Vệ sinh khoang máy', 850000.00, 1),
(17, 17, 5, 'Tẩy ố kính & Phủ Nano', 600000.00, 1),
(18, 18, 6, 'Vệ sinh nội thất chuyên sâu', 1500000.00, 1),
(19, 19, 1, 'Rửa Xe', 1000000.00, 1),
(20, 20, 9, 'Thay dầu & Lọc nhớt', 1200000.00, 1),
(21, 21, 3, 'Rửa xe chi tiết (Detailing)', 250000.00, 1),
(22, 22, 2, 'Thay Lốp', 1000000.00, 1),
(23, 23, 3, 'Rửa xe chi tiết (Detailing)', 250000.00, 1),
(24, 24, 4, 'Vệ sinh khoang máy', 850000.00, 1),
(25, 25, 5, 'Tẩy ố kính & Phủ Nano', 600000.00, 1),
(26, 26, 6, 'Vệ sinh nội thất chuyên sâu', 1500000.00, 1),
(27, 27, 7, 'Đánh bóng hiệu chỉnh sơn', 2500000.00, 1),
(28, 28, 8, 'Phủ Ceramic bảo vệ sơn', 5500000.00, 1),
(29, 29, 9, 'Thay dầu & Lọc nhớt', 1200000.00, 1),
(30, 30, 1, 'Rửa Xe', 1000000.00, 1),
(31, 31, 2, 'Thay Lốp', 1000000.00, 1),
(32, 32, 3, 'Rửa xe chi tiết (Detailing)', 250000.00, 1),
(33, 33, 1, 'Rửa Xe', 1000000.00, 1),
(34, 34, 2, 'Thay Lốp', 1000000.00, 1),
(35, 35, 3, 'Rửa xe chi tiết (Detailing)', 250000.00, 1),
(36, 36, 4, 'Vệ sinh khoang máy', 850000.00, 1),
(37, 37, 4, 'Vệ sinh khoang máy', 850000.00, 1),
(38, 38, 5, 'Tẩy ố kính & Phủ Nano', 600000.00, 1),
(39, 39, 6, 'Vệ sinh nội thất chuyên sâu', 1500000.00, 1),
(40, 40, 1, 'Rửa Xe', 1000000.00, 1),
(41, 41, 2, 'Thay Lốp', 1000000.00, 1),
(42, 42, 3, 'Rửa xe chi tiết (Detailing)', 250000.00, 1),
(43, 43, 4, 'Vệ sinh khoang máy', 850000.00, 1),
(44, 44, 5, 'Tẩy ố kính & Phủ Nano', 600000.00, 1),
(45, 45, 6, 'Vệ sinh nội thất chuyên sâu', 1500000.00, 1),
(46, 46, 7, 'Đánh bóng hiệu chỉnh sơn', 2500000.00, 1),
(47, 47, 9, 'Thay dầu & Lọc nhớt', 1200000.00, 1),
(48, 48, 13, 'Bảo dưỡng định kỳ 10.000km', 2500000.00, 1),
(49, 49, 8, 'Phủ Ceramic bảo vệ sơn', 5500000.00, 1),
(50, 50, 10, 'Kiểm tra phanh & Gầm', 400000.00, 1),
(51, 51, 1, 'Rửa Xe', 1000000.00, 1),
(52, 52, 2, 'Thay Lốp', 1000000.00, 1),
(53, 53, 3, 'Rửa xe chi tiết (Detailing)', 250000.00, 1),
(54, 54, 4, 'Vệ sinh khoang máy', 850000.00, 1),
(55, 55, 5, 'Tẩy ố kính & Phủ Nano', 600000.00, 1),
(56, 56, 6, 'Vệ sinh nội thất chuyên sâu', 1500000.00, 1),
(57, 57, 5, 'Tẩy ố kính & Phủ Nano', 600000.00, 1),
(58, 58, 13, 'Bảo dưỡng định kỳ 10.000km', 2500000.00, 1),
(59, 59, 14, 'Thay dầu động cơ', 800000.00, 1),
(60, 60, 4, 'Vệ sinh khoang máy', 850000.00, 1),
(61, 61, 3, 'Rửa xe chi tiết (Detailing)', 250000.00, 1),
(62, 62, 6, 'Vệ sinh nội thất chuyên sâu', 1500000.00, 1),
(63, 63, 10, 'Kiểm tra phanh & Gầm', 400000.00, 1),
(64, 64, 1, 'Rửa Xe', 1000000.00, 1),
(65, 65, 2, 'Thay Lốp', 1000000.00, 1),
(66, 66, 4, 'Vệ sinh khoang máy', 850000.00, 1),
(67, 67, 11, 'Bơm khí Nitơ 4 bánh', 100000.00, 1),
(68, 68, 12, 'Cân bằng động bánh xe', 300000.00, 1),
(69, 69, 7, 'Đánh bóng hiệu chỉnh sơn', 2500000.00, 1),
(70, 70, 12, 'Cân bằng động bánh xe', 300000.00, 1),
(71, 71, 11, 'Bơm khí Nitơ 4 bánh', 100000.00, 1),
(72, 72, 10, 'Kiểm tra phanh & Gầm', 400000.00, 1),
(73, 73, 2, 'Thay Lốp', 1000000.00, 1),
(74, 74, 3, 'Rửa xe chi tiết (Detailing)', 250000.00, 1),
(75, 75, 4, 'Vệ sinh khoang máy', 850000.00, 1),
(76, 76, 6, 'Vệ sinh nội thất chuyên sâu', 1500000.00, 1),
(77, 77, 7, 'Đánh bóng hiệu chỉnh sơn', 2500000.00, 1),
(78, 78, 5, 'Tẩy ố kính & Phủ Nano', 600000.00, 1),
(79, 79, 8, 'Phủ Ceramic bảo vệ sơn', 5500000.00, 1),
(80, 80, 9, 'Thay dầu & Lọc nhớt', 1200000.00, 1),
(81, 81, 13, 'Bảo dưỡng định kỳ 10.000km', 2500000.00, 1),
(82, 82, 11, 'Bơm khí Nitơ 4 bánh', 100000.00, 1),
(83, 83, 4, 'Vệ sinh khoang máy', 850000.00, 1),
(84, 84, 5, 'Tẩy ố kính & Phủ Nano', 600000.00, 1),
(85, 85, 8, 'Phủ Ceramic bảo vệ sơn', 5500000.00, 1),
(86, 86, 6, 'Vệ sinh nội thất chuyên sâu', 1500000.00, 1),
(87, 87, 10, 'Kiểm tra phanh & Gầm', 400000.00, 1),
(88, 88, 7, 'Đánh bóng hiệu chỉnh sơn', 2500000.00, 1),
(89, 89, 9, 'Thay dầu & Lọc nhớt', 1200000.00, 1),
(90, 90, 2, 'Thay Lốp', 1000000.00, 1),
(91, 91, 3, 'Rửa xe chi tiết (Detailing)', 250000.00, 1),
(92, 92, 4, 'Vệ sinh khoang máy', 850000.00, 1),
(93, 93, 5, 'Tẩy ố kính & Phủ Nano', 600000.00, 1),
(94, 94, 6, 'Vệ sinh nội thất chuyên sâu', 1500000.00, 1),
(95, 95, 7, 'Đánh bóng hiệu chỉnh sơn', 2500000.00, 1),
(96, 96, 8, 'Phủ Ceramic bảo vệ sơn', 5500000.00, 1),
(97, 97, 9, 'Thay dầu & Lọc nhớt', 1200000.00, 1),
(98, 98, 4, 'Vệ sinh khoang máy', 850000.00, 1),
(99, 99, 10, 'Kiểm tra phanh & Gầm', 400000.00, 1),
(100, 100, 2, 'Thay Lốp', 1000000.00, 1),
(101, 101, 4, 'Vệ sinh khoang máy', 850000.00, 1),
(102, 101, 5, 'Tẩy ố kính & Phủ Nano', 600000.00, 1),
(103, 102, 7, 'Đánh bóng hiệu chỉnh sơn', 2500000.00, 1),
(104, 102, 9, 'Thay dầu & Lọc nhớt', 1200000.00, 1),
(105, 102, 10, 'Kiểm tra phanh & Gầm', 400000.00, 1),
(106, 102, 11, 'Bơm khí Nitơ 4 bánh', 100000.00, 1),
(107, 103, 2, 'Thay Lốp', 1000000.00, 1),
(108, 103, 3, 'Rửa xe chi tiết (Detailing)', 250000.00, 1),
(109, 103, 4, 'Vệ sinh khoang máy', 850000.00, 1),
(110, 104, 1, 'Rửa Xe', 1000000.00, 1),
(111, 104, 2, 'Thay Lốp', 1000000.00, 1),
(112, 104, 3, 'Rửa xe chi tiết (Detailing)', 250000.00, 1),
(113, 104, 4, 'Vệ sinh khoang máy', 850000.00, 1),
(114, 104, 5, 'Tẩy ố kính & Phủ Nano', 600000.00, 1),
(115, 104, 6, 'Vệ sinh nội thất chuyên sâu', 1500000.00, 1),
(116, 104, 7, 'Đánh bóng hiệu chỉnh sơn', 2500000.00, 1),
(117, 104, 8, 'Phủ Ceramic bảo vệ sơn', 5500000.00, 1),
(118, 104, 9, 'Thay dầu & Lọc nhớt', 1200000.00, 1),
(119, 104, 10, 'Kiểm tra phanh & Gầm', 400000.00, 1),
(120, 104, 11, 'Bơm khí Nitơ 4 bánh', 100000.00, 1),
(121, 104, 12, 'Cân bằng động bánh xe', 300000.00, 1),
(122, 104, 13, 'Bảo dưỡng định kỳ 10.000km', 2500000.00, 1),
(123, 104, 14, 'Thay dầu động cơ', 800000.00, 1),
(124, 104, 15, 'Thay má phanh', 1200000.00, 1),
(125, 104, 16, 'Lắp camera hành trình', 500000.00, 1),
(126, 104, 17, 'Thay gạt mưa', 200000.00, 1),
(127, 104, 18, 'Thay lọc gió động cơ', 150000.00, 1),
(128, 104, 19, 'Thay bugi', 400000.00, 1),
(129, 104, 20, 'Cân chỉnh góc đặt bánh xe', 500000.00, 1),
(130, 104, 21, 'Thay Bọc Vô Lăng', 200000.00, 1),
(131, 104, 22, 'Thay lót sàn', 350000.00, 1),
(132, 104, 23, 'Lắp  tấm chắn nắng', 350000.00, 1),
(133, 105, 1, 'Rửa Xe', 1000000.00, 1),
(134, 105, 2, 'Thay Lốp', 1000000.00, 1),
(135, 105, 3, 'Rửa xe chi tiết (Detailing)', 250000.00, 1),
(136, 105, 4, 'Vệ sinh khoang máy', 850000.00, 1),
(137, 105, 5, 'Tẩy ố kính & Phủ Nano', 600000.00, 1),
(138, 105, 6, 'Vệ sinh nội thất chuyên sâu', 1500000.00, 1),
(139, 105, 7, 'Đánh bóng hiệu chỉnh sơn', 2500000.00, 1),
(140, 105, 8, 'Phủ Ceramic bảo vệ sơn', 5500000.00, 1),
(141, 105, 9, 'Thay dầu & Lọc nhớt', 1200000.00, 1),
(142, 106, 1, 'Rửa Xe', 1000000.00, 1),
(143, 106, 2, 'Thay Lốp', 1000000.00, 1),
(144, 106, 3, 'Rửa xe chi tiết (Detailing)', 250000.00, 1),
(145, 106, 4, 'Vệ sinh khoang máy', 850000.00, 1),
(146, 106, 5, 'Tẩy ố kính & Phủ Nano', 600000.00, 1),
(147, 106, 6, 'Vệ sinh nội thất chuyên sâu', 1500000.00, 1),
(148, 106, 7, 'Đánh bóng hiệu chỉnh sơn', 2500000.00, 1),
(149, 106, 8, 'Phủ Ceramic bảo vệ sơn', 5500000.00, 1),
(150, 106, 9, 'Thay dầu & Lọc nhớt', 1200000.00, 1),
(151, 106, 10, 'Kiểm tra phanh & Gầm', 400000.00, 1),
(152, 106, 11, 'Bơm khí Nitơ 4 bánh', 100000.00, 1),
(153, 106, 12, 'Cân bằng động bánh xe', 300000.00, 1),
(154, 106, 13, 'Bảo dưỡng định kỳ 10.000km', 2500000.00, 1),
(155, 106, 14, 'Thay dầu động cơ', 800000.00, 1),
(156, 106, 15, 'Thay má phanh', 1200000.00, 1),
(157, 106, 16, 'Lắp camera hành trình', 500000.00, 1),
(158, 106, 17, 'Thay gạt mưa', 200000.00, 1),
(159, 106, 18, 'Thay lọc gió động cơ', 150000.00, 1),
(160, 106, 19, 'Thay bugi', 400000.00, 1),
(161, 106, 20, 'Cân chỉnh góc đặt bánh xe', 500000.00, 1),
(162, 106, 21, 'Thay Bọc Vô Lăng', 200000.00, 1),
(163, 106, 22, 'Thay lót sàn', 350000.00, 1),
(164, 106, 23, 'Lắp  tấm chắn nắng', 350000.00, 1),
(165, 107, NULL, NULL, 0.00, 1),
(166, 108, 4, 'Vệ sinh khoang máy', 850000.00, 1),
(167, 108, 5, 'Tẩy ố kính & Phủ Nano', 600000.00, 1),
(168, 108, 6, 'Vệ sinh nội thất chuyên sâu', 1500000.00, 1),
(169, 108, 7, 'Đánh bóng hiệu chỉnh sơn', 2500000.00, 1),
(170, 108, 8, 'Phủ Ceramic bảo vệ sơn', 5500000.00, 1),
(171, 108, 9, 'Thay dầu & Lọc nhớt', 1200000.00, 1),
(172, 109, 2, 'Thay Lốp', 1000000.00, 1),
(173, 109, 3, 'Rửa xe chi tiết (Detailing)', 250000.00, 1),
(174, 109, 4, 'Vệ sinh khoang máy', 850000.00, 1),
(175, 109, 5, 'Tẩy ố kính & Phủ Nano', 600000.00, 1),
(176, 109, 12, 'Cân bằng động bánh xe', 300000.00, 1),
(177, 109, 13, 'Bảo dưỡng định kỳ 10.000km', 2500000.00, 1),
(178, 110, 1, 'Rửa Xe', 1000000.00, 1),
(179, 110, 5, 'Tẩy ố kính & Phủ Nano', 600000.00, 1),
(180, 110, 6, 'Vệ sinh nội thất chuyên sâu', 1500000.00, 1),
(181, 110, 7, 'Đánh bóng hiệu chỉnh sơn', 2500000.00, 1),
(182, 111, 5, 'Tẩy ố kính & Phủ Nano', 600000.00, 1),
(183, 111, 6, 'Vệ sinh nội thất chuyên sâu', 1500000.00, 1),
(184, 111, 7, 'Đánh bóng hiệu chỉnh sơn', 2500000.00, 1),
(185, 111, 9, 'Thay dầu & Lọc nhớt', 1200000.00, 1),
(186, 112, 2, 'Thay Lốp', 1000000.00, 1),
(187, 112, 3, 'Rửa xe chi tiết (Detailing)', 250000.00, 1),
(188, 112, 6, 'Vệ sinh nội thất chuyên sâu', 1500000.00, 1),
(189, 113, 2, 'Thay Lốp', 1000000.00, 1),
(190, 113, 3, 'Rửa xe chi tiết (Detailing)', 250000.00, 1),
(191, 113, 4, 'Vệ sinh khoang máy', 850000.00, 1),
(192, 114, 3, 'Rửa xe chi tiết (Detailing)', 250000.00, 1),
(193, 114, 4, 'Vệ sinh khoang máy', 850000.00, 1),
(194, 114, 9, 'Thay dầu & Lọc nhớt', 1200000.00, 1),
(195, 115, 3, 'Rửa xe chi tiết (Detailing)', 250000.00, 1),
(196, 115, 5, 'Tẩy ố kính & Phủ Nano', 600000.00, 1),
(197, 115, 6, 'Vệ sinh nội thất chuyên sâu', 1500000.00, 1),
(198, 115, 9, 'Thay dầu & Lọc nhớt', 1200000.00, 1),
(199, 116, 7, 'Đánh bóng hiệu chỉnh sơn', 2500000.00, 1),
(200, 116, 8, 'Phủ Ceramic bảo vệ sơn', 5500000.00, 1),
(201, 116, 9, 'Thay dầu & Lọc nhớt', 1200000.00, 1),
(202, 116, 10, 'Kiểm tra phanh & Gầm', 400000.00, 1),
(203, 117, 2, 'Thay Lốp', 1000000.00, 1),
(204, 117, 3, 'Rửa xe chi tiết (Detailing)', 250000.00, 1),
(205, 117, 4, 'Vệ sinh khoang máy', 850000.00, 1),
(206, 118, 2, 'Thay Lốp', 1000000.00, 1),
(207, 118, 21, 'Thay Bọc Vô Lăng', 200000.00, 1);

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `invoice_products`
--

CREATE TABLE `invoice_products` (
  `id` int(11) NOT NULL,
  `invoice_id` int(11) NOT NULL,
  `product_id` int(11) NOT NULL,
  `product_name` varchar(255) DEFAULT NULL,
  `quantity` int(11) NOT NULL,
  `price` decimal(15,2) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Đang đổ dữ liệu cho bảng `invoice_products`
--

INSERT INTO `invoice_products` (`id`, `invoice_id`, `product_id`, `product_name`, `quantity`, `price`) VALUES
(1, 22, 4, 'Lốp xe 195/65R15', 4, 1500000.00),
(2, 22, 9, 'Nước làm mát hồng', 1, 150000.00),
(3, 22, 20, 'Bộ dụng cụ cứu hộ', 2, 1250000.00),
(4, 29, 1, 'Nhớt động cơ 5W-30', 1, 180000.00),
(5, 29, 12, 'Lọc dầu nhớt', 1, 110000.00),
(6, 31, 4, 'Lốp xe 195/65R15', 4, 1500000.00),
(7, 31, 9, 'Nước làm mát hồng', 1, 150000.00),
(8, 31, 20, 'Bộ dụng cụ cứu hộ', 2, 1250000.00),
(9, 34, 4, 'Lốp xe 195/65R15', 1, 1500000.00),
(10, 34, 9, 'Nước làm mát hồng', 1, 150000.00),
(11, 34, 20, 'Bộ dụng cụ cứu hộ', 2, 1250000.00),
(12, 41, 4, 'Lốp xe 195/65R15', 3, 1500000.00),
(13, 41, 9, 'Nước làm mát hồng', 1, 150000.00),
(14, 41, 20, 'Bộ dụng cụ cứu hộ', 2, 1250000.00),
(15, 50, 3, 'Má phanh trước', 1, 850000.00),
(16, 50, 17, 'Phuộc nhún trước', 1, 2200000.00),
(17, 50, 19, 'Dầu phanh DOT 4', 1, 135000.00),
(18, 59, 1, 'Nhớt động cơ 5W-30', 3, 180000.00),
(19, 59, 12, 'Lọc dầu nhớt', 1, 110000.00),
(20, 58, 1, 'Nhớt động cơ 5W-30', 4, 180000.00),
(21, 58, 2, 'Lọc gió động cơ', 1, 120000.00),
(22, 58, 10, 'Bugi bạch kim', 4, 95000.00),
(23, 58, 12, 'Lọc dầu nhớt', 1, 110000.00),
(24, 58, 13, 'Gạt mưa silicon', 2, 350000.00),
(25, 63, 3, 'Má phanh trước', 2, 850000.00),
(26, 63, 17, 'Phuộc nhún trước', 1, 2200000.00),
(27, 63, 19, 'Dầu phanh DOT 4', 1, 135000.00),
(28, 65, 4, 'Lốp xe 195/65R15', 2, 1500000.00),
(29, 65, 9, 'Nước làm mát hồng', 1, 150000.00),
(30, 65, 20, 'Bộ dụng cụ cứu hộ', 2, 1250000.00),
(31, 110, 1, 'Nhớt động cơ 5W-30', 1, 180000.00),
(32, 110, 9, 'Nước làm mát hồng', 1, 150000.00),
(33, 115, 2, 'Lọc gió động cơ', 1, 120000.00),
(34, 115, 6, 'Nước hoa xe hơi', 1, 80000.00),
(35, 117, 4, 'Lốp xe 195/65R15', 4, 1500000.00),
(36, 117, 9, 'Nước làm mát hồng', 1, 150000.00),
(37, 117, 20, 'Bộ dụng cụ cứu hộ', 2, 1250000.00),
(38, 118, 4, 'Lốp xe 195/65R15', 4, 1500000.00),
(39, 118, 9, 'Nước làm mát hồng', 1, 150000.00),
(40, 118, 11, 'Bọc vô lăng da', 1, 450000.00),
(41, 118, 20, 'Bộ dụng cụ cứu hộ', 2, 1250000.00);

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `payments`
--

CREATE TABLE `payments` (
  `id` int(11) NOT NULL,
  `invoice_id` int(11) DEFAULT NULL,
  `amount` decimal(12,2) DEFAULT NULL,
  `payment_method` enum('Tiền mặt','Chuyển khoản','Momo','ZaloPay') DEFAULT NULL,
  `note` text DEFAULT NULL,
  `payment_date` datetime DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Đang đổ dữ liệu cho bảng `payments`
--

INSERT INTO `payments` (`id`, `invoice_id`, `amount`, `payment_method`, `note`, `payment_date`) VALUES
(2, 5, 1000000.00, 'Chuyển khoản', '', '2026-04-24 16:01:22'),
(3, 6, 250000.00, 'Chuyển khoản', '', '2026-04-24 16:09:13'),
(4, 7, 850000.00, 'Tiền mặt', '', '2026-04-24 16:09:36'),
(5, 8, 600000.00, 'Chuyển khoản', '', '2026-04-24 16:15:21'),
(6, 9, 1500000.00, 'Tiền mặt', '', '2026-04-24 16:15:27'),
(7, 10, 2500000.00, 'Tiền mặt', '', '2026-04-24 16:15:31'),
(8, 11, 5500000.00, 'Tiền mặt', '', '2026-04-24 16:15:35'),
(9, 12, 1200000.00, 'Tiền mặt', '', '2026-04-24 16:15:47'),
(10, 5, 1000000.00, 'Tiền mặt', NULL, '2026-04-24 16:16:05'),
(11, 6, 250000.00, 'Tiền mặt', NULL, '2026-04-24 16:16:50'),
(12, 15, 1000000.00, 'Chuyển khoản', 'hay', '2026-04-24 16:35:08'),
(13, 14, 1000000.00, 'Chuyển khoản', '', '2026-04-24 16:39:46'),
(14, 17, 600000.00, 'Chuyển khoản', '', '2026-04-24 16:45:51'),
(15, 16, 850000.00, 'Tiền mặt', '', '2026-04-24 16:45:59'),
(16, 13, 250000.00, 'Chuyển khoản', '', '2026-04-24 16:46:05'),
(17, 18, 1500000.00, 'Chuyển khoản', '', '2026-04-29 22:48:55'),
(18, 19, 1000000.00, 'Tiền mặt', '', '2026-04-30 00:25:43'),
(19, 21, 250000.00, 'Tiền mặt', '', '2026-04-30 00:51:23'),
(20, 20, 1200000.00, 'Tiền mặt', '', '2026-04-30 00:51:26'),
(21, 27, 2500000.00, 'Chuyển khoản', '', '2026-04-30 02:18:05'),
(22, 26, 1500000.00, 'Tiền mặt', '', '2026-04-30 02:18:10'),
(23, 25, 600000.00, 'Tiền mặt', '', '2026-04-30 02:18:14'),
(24, 24, 850000.00, 'Tiền mặt', '', '2026-04-30 02:18:19'),
(25, 23, 250000.00, 'Tiền mặt', '', '2026-04-30 02:18:25'),
(26, 22, 1000000.00, 'Tiền mặt', '', '2026-04-30 02:18:38'),
(27, 29, 1200000.00, 'Tiền mặt', '', '2026-04-30 02:19:40'),
(28, 28, 5500000.00, 'Tiền mặt', '', '2026-04-30 02:19:49'),
(29, 32, 250000.00, 'Chuyển khoản', '', '2026-04-30 02:27:42'),
(30, 31, 1000000.00, 'Tiền mặt', '', '2026-05-01 00:01:31'),
(31, 30, 1000000.00, 'Chuyển khoản', '', '2026-05-01 00:01:52'),
(32, 36, 850000.00, 'Chuyển khoản', '', '2026-05-01 00:05:00'),
(33, 35, 250000.00, 'ZaloPay', '', '2026-05-01 00:05:14'),
(34, 34, 1000000.00, 'Tiền mặt', '', '2026-05-01 00:06:10'),
(35, 33, 1000000.00, 'Tiền mặt', '', '2026-05-01 00:06:26'),
(36, 38, 600000.00, 'Chuyển khoản', '', '2026-05-01 00:21:32'),
(37, 39, 1500000.00, 'Momo', '', '2026-05-01 00:22:15'),
(38, 37, 850000.00, 'Chuyển khoản', '', '2026-05-01 00:24:33'),
(39, 41, 400000.00, 'Chuyển khoản', '', '2026-05-01 00:39:40'),
(40, 40, 1000000.00, 'Chuyển khoản', '', '2026-05-01 00:57:46'),
(41, 41, 600000.00, 'Chuyển khoản', '', '2026-05-01 00:57:58'),
(42, 45, 600000.00, 'Chuyển khoản', '', '2026-05-01 00:59:05'),
(43, 44, 600000.00, 'Chuyển khoản', '', '2026-05-01 00:59:32'),
(44, 44, 600000.00, 'Chuyển khoản', '', '2026-05-01 00:59:34'),
(45, 43, 850000.00, 'Tiền mặt', '', '2026-05-01 00:59:40'),
(46, 42, 250000.00, 'Tiền mặt', '', '2026-05-01 00:59:47'),
(47, 45, 900000.00, 'Tiền mặt', '', '2026-05-01 00:59:57'),
(48, 46, 2500000.00, 'Momo', '', '2026-05-01 01:15:38'),
(49, 47, 1200000.00, 'Chuyển khoản', '', '2026-05-01 01:49:36'),
(50, 49, 5500000.00, 'Chuyển khoản', '', '2026-05-01 02:04:10'),
(51, 48, 2500000.00, 'Chuyển khoản', '', '2026-05-01 02:19:23'),
(52, 50, 400000.00, 'Chuyển khoản', '', '2026-05-02 00:05:26'),
(53, 51, 1000000.00, 'Tiền mặt', '', '2026-05-02 00:11:03'),
(54, 52, 1000000.00, 'Tiền mặt', '', '2026-05-02 00:11:03'),
(55, 53, 250000.00, 'Tiền mặt', '', '2026-05-02 00:11:04'),
(56, 54, 850000.00, 'Tiền mặt', '', '2026-05-02 00:11:04'),
(57, 55, 600000.00, 'Chuyển khoản', '', '2026-05-02 00:26:43'),
(58, 56, 1500000.00, 'Chuyển khoản', '', '2026-05-02 00:26:43'),
(59, 57, 600000.00, 'Tiền mặt', '', '2026-05-02 01:46:00'),
(60, 58, 2500000.00, 'Tiền mặt', '', '2026-05-02 01:46:00'),
(61, 59, 800000.00, 'Tiền mặt', '', '2026-05-02 01:46:00'),
(62, 60, 850000.00, 'Tiền mặt', '', '2026-05-02 01:46:00'),
(63, 61, 250000.00, 'Tiền mặt', '', '2026-05-04 15:59:49'),
(64, 62, 1500000.00, 'Tiền mặt', '', '2026-05-04 15:59:49'),
(65, 63, 400000.00, 'Tiền mặt', '', '2026-05-04 15:59:49'),
(66, 64, 1000000.00, 'Tiền mặt', '', '2026-05-04 15:59:49'),
(67, 65, 1000000.00, 'Tiền mặt', '', '2026-05-04 16:01:02'),
(68, 66, 850000.00, 'Tiền mặt', '', '2026-05-04 16:08:42'),
(69, 67, 100000.00, 'Tiền mặt', '', '2026-05-04 16:20:21'),
(70, 68, 300000.00, 'Tiền mặt', '', '2026-05-04 16:20:21'),
(71, 69, 2500000.00, 'Tiền mặt', '', '2026-05-04 16:20:39'),
(72, 70, 300000.00, 'Tiền mặt', '', '2026-05-04 16:31:33'),
(73, 71, 100000.00, 'Tiền mặt', '', '2026-05-04 16:31:33'),
(74, 72, 400000.00, 'Tiền mặt', '', '2026-05-04 16:31:33'),
(75, 73, 1000000.00, 'Tiền mặt', '', '2026-05-04 16:31:33'),
(76, 74, 250000.00, 'Tiền mặt', '', '2026-05-04 16:32:13'),
(77, 75, 850000.00, 'Tiền mặt', '', '2026-05-04 16:32:13'),
(78, 76, 1500000.00, 'Momo', '', '2026-05-04 16:32:56'),
(79, 77, 2500000.00, 'Momo', '', '2026-05-04 16:32:56'),
(80, 82, 100000.00, 'Chuyển khoản', '', '2026-05-04 17:01:06'),
(81, 83, 850000.00, 'Chuyển khoản', '', '2026-05-04 17:01:06'),
(82, 84, 600000.00, 'Chuyển khoản', '', '2026-05-04 17:01:06'),
(83, 85, 5500000.00, 'Chuyển khoản', '', '2026-05-04 17:16:58'),
(84, 86, 1500000.00, 'Chuyển khoản', '', '2026-05-06 16:01:08'),
(85, 78, 600000.00, 'Chuyển khoản', '', '2026-05-06 16:14:24'),
(86, 79, 5500000.00, 'Chuyển khoản', '', '2026-05-06 16:14:24'),
(87, 80, 1200000.00, 'Chuyển khoản', '', '2026-05-06 16:14:24'),
(88, 81, 2500000.00, 'Chuyển khoản', '', '2026-05-06 16:14:24'),
(89, 101, 1450000.00, 'Tiền mặt', '', '2026-05-07 10:04:47'),
(90, 90, 1000000.00, 'Chuyển khoản', '', '2026-05-07 10:46:09'),
(91, 91, 250000.00, 'Chuyển khoản', '', '2026-05-07 10:46:09'),
(92, 92, 850000.00, 'Chuyển khoản', '', '2026-05-07 10:46:09'),
(93, 93, 600000.00, 'Chuyển khoản', '', '2026-05-07 10:46:09'),
(94, 94, 1500000.00, 'Chuyển khoản', '', '2026-05-07 10:46:09'),
(95, 95, 2500000.00, 'Chuyển khoản', '', '2026-05-07 10:46:09'),
(96, 96, 5500000.00, 'Chuyển khoản', '', '2026-05-07 10:46:09'),
(97, 97, 1200000.00, 'Chuyển khoản', '', '2026-05-07 10:46:09'),
(98, 98, 850000.00, 'Chuyển khoản', '', '2026-05-07 10:46:09'),
(99, 99, 400000.00, 'Chuyển khoản', '', '2026-05-07 10:46:09'),
(100, 100, 1000000.00, 'Chuyển khoản', '', '2026-05-07 10:46:09'),
(101, 102, 4200000.00, 'Chuyển khoản', '', '2026-05-07 10:46:09'),
(102, 103, 2100000.00, 'Tiền mặt', '', '2026-05-08 16:13:15'),
(103, 87, 400000.00, 'Tiền mặt', '', '2026-05-08 16:13:20'),
(104, 88, 2500000.00, 'Tiền mặt', '', '2026-05-08 16:13:20'),
(105, 89, 1200000.00, 'Tiền mặt', '', '2026-05-08 16:13:20'),
(106, 104, 22350000.00, 'Tiền mặt', '', '2026-05-08 16:19:20'),
(107, 106, 22350000.00, 'Tiền mặt', '', '2026-05-09 11:32:41'),
(108, 105, 14400000.00, 'Tiền mặt', '', '2026-05-09 11:32:48'),
(109, 109, 5500000.00, 'Tiền mặt', '', '2026-05-11 16:09:17'),
(110, 108, 12150000.00, 'Tiền mặt', '', '2026-05-11 16:09:26'),
(111, 110, 5600000.00, 'Tiền mặt', '', '2026-05-11 16:15:59'),
(112, 111, 5800000.00, 'Tiền mặt', '', '2026-05-11 16:18:00'),
(113, 112, 2750000.00, 'Tiền mặt', '', '2026-05-11 16:23:26'),
(114, 113, 2100000.00, 'Tiền mặt', '', '2026-05-11 16:34:25'),
(115, 114, 2300000.00, 'Tiền mặt', '', '2026-05-11 16:37:05'),
(116, 115, 3550000.00, 'Tiền mặt', '', '2026-05-11 17:05:53'),
(117, 116, 9600000.00, 'Tiền mặt', '', '2026-05-11 17:06:06'),
(118, 117, 2100000.00, 'Tiền mặt', '', '2026-05-11 17:09:51');

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `services`
--

CREATE TABLE `services` (
  `id` int(11) NOT NULL,
  `service_name` varchar(100) NOT NULL,
  `category` varchar(50) DEFAULT NULL,
  `price` decimal(15,2) NOT NULL,
  `duration_min` int(11) DEFAULT NULL,
  `description` text DEFAULT NULL,
  `status` tinyint(4) DEFAULT 1,
  `image_path` varchar(255) DEFAULT 'default_service.png',
  `require_inventory` tinyint(1) DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Đang đổ dữ liệu cho bảng `services`
--

INSERT INTO `services` (`id`, `service_name`, `category`, `price`, `duration_min`, `description`, `status`, `image_path`, `require_inventory`) VALUES
(1, 'Rửa Xe', 'Làm đẹp', 1000000.00, 60, 'ComBo VIP Pro', 1, 'default_service.png', 0),
(2, 'Thay Lốp', 'Bảo dưỡng', 1000000.00, 30, 'giá cả bao đỉnh', 1, 'default_service.png', 1),
(3, 'Rửa xe chi tiết (Detailing)', 'Làm đẹp', 250000.00, 60, 'Rửa xe sâu, vệ sinh hốc bánh, khe cửa và dưỡng lốp bóng.', 1, 'default_service.png', 0),
(4, 'Vệ sinh khoang máy', 'Bảo dưỡng', 850000.00, 120, 'Dùng hơi nước nóng vệ sinh động cơ và phủ dưỡng bảo vệ chi tiết nhựa.', 1, 'default_service.png', 0),
(5, 'Tẩy ố kính & Phủ Nano', 'Làm đẹp', 600000.00, 90, 'Loại bỏ vết ố nước trên kính và phủ lớp Nano chống bám nước mưa.', 1, 'default_service.png', 0),
(6, 'Vệ sinh nội thất chuyên sâu', 'Làm đẹp', 1500000.00, 240, 'Giặt ghế, trần, thảm và khử mùi bằng máy Ozone hiện đại.', 1, 'default_service.png', 0),
(7, 'Đánh bóng hiệu chỉnh sơn', 'Làm đẹp', 2500000.00, 360, 'Xóa vết xước dăm và phục hồi độ bóng như mới cho bề mặt sơn.', 1, 'default_service.png', 0),
(8, 'Phủ Ceramic bảo vệ sơn', 'Làm đẹp', 5500000.00, 480, 'Phủ lớp gốm Ceramic cao cấp giúp chống tia UV và hạn chế trầy xước.', 1, 'default_service.png', 0),
(9, 'Thay dầu & Lọc nhớt', 'Bảo dưỡng', 1200000.00, 45, 'Thay nhớt tổng hợp cao cấp và lọc nhớt chính hãng cho xe.', 1, 'default_service.png', 1),
(10, 'Kiểm tra phanh & Gầm', 'Kiểm tra định kỳ', 400000.00, 60, 'Kiểm tra độ mòn má phanh, láng đĩa phanh và siết lại ốc gầm.', 1, 'default_service.png', 1),
(11, 'Bơm khí Nitơ 4 bánh', 'Bảo dưỡng', 100000.00, 20, 'Thay thế không khí thường bằng Nitơ giúp ổn định áp suất lốp.', 1, 'default_service.png', 0),
(12, 'Cân bằng động bánh xe', 'Sửa chữa', 300000.00, 40, 'Khắc phục tình trạng rung vô lăng khi chạy ở tốc độ cao.', 1, 'default_service.png', 0),
(13, 'Bảo dưỡng định kỳ 10.000km', 'Bảo dưỡng', 2500000.00, 120, 'Bảo dưỡng toàn diện các hạng mục', 1, 'default_service.png', 1),
(14, 'Thay dầu động cơ', 'Bảo dưỡng', 800000.00, 45, 'Thay dầu nhớt và lọc dầu', 1, 'default_service.png', 1),
(15, 'Thay má phanh', 'Sửa chữa', 1200000.00, 90, 'Thay má phanh trước/sau', 1, 'default_service.png', 1),
(16, 'Lắp camera hành trình', 'Phụ kiện', 500000.00, 60, 'Lắp đặt camera trước/sau', 1, 'default_service.png', 1),
(17, 'Thay gạt mưa', 'Bảo dưỡng', 200000.00, 20, 'Thay mới gạt mưa', 1, 'default_service.png', 1),
(18, 'Thay lọc gió động cơ', 'Bảo dưỡng', 150000.00, 15, 'Thay lọc gió động cơ', 1, 'default_service.png', 1),
(19, 'Thay bugi', 'Bảo dưỡng', 400000.00, 30, 'Thay bugi bạch kim', 1, 'default_service.png', 1),
(20, 'Cân chỉnh góc đặt bánh xe', 'Sửa chữa', 500000.00, 60, 'Cân chỉnh camber, caster, toe', 1, 'default_service.png', 0),
(21, 'Thay Bọc Vô Lăng', 'Thay thế phụ tùng', 200000.00, 15, 'Thay Bọc vô lăng', 1, 'default_service.png', 1),
(22, 'Thay lót sàn', 'Thay thế phụ tùng', 350000.00, 30, 'Thay lót sàn', 1, 'default_service.png', 1),
(23, 'Lắp  tấm chắn nắng', 'Làm đẹp', 350000.00, 30, 'Lắp  tấm chắn nắng', 1, 'default_service.png', 1);

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `service_history`
--

CREATE TABLE `service_history` (
  `id` int(11) NOT NULL,
  `customer_id` int(11) DEFAULT NULL,
  `service_name` varchar(255) DEFAULT NULL,
  `plate_number` varchar(20) DEFAULT NULL,
  `service_date` date DEFAULT NULL,
  `service_time` time DEFAULT NULL,
  `price` decimal(15,2) DEFAULT NULL,
  `status` varchar(50) DEFAULT NULL,
  `note` text DEFAULT NULL,
  `appointment_id` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Đang đổ dữ liệu cho bảng `service_history`
--

INSERT INTO `service_history` (`id`, `customer_id`, `service_name`, `plate_number`, `service_date`, `service_time`, `price`, `status`, `note`, `appointment_id`) VALUES
(1, 4, 'Rửa Xe', '30A 2222', '2026-04-10', '08:30:00', 1000000.00, 'Hoàn thành', 'Combo VIP Pro', NULL),
(2, 4, 'Thay dầu & Lọc nhớt', '30A 2222', '2026-03-15', '14:00:00', 1200000.00, 'Hoàn thành', 'Bảo dưỡng định kỳ', NULL),
(3, 10, 'Rửa xe chi tiết (Detailing)', '30A1234567', '2026-04-12', '10:00:00', 250000.00, 'Hoàn thành', 'Khách hàng hài lòng', NULL),
(4, 10, 'Kiểm tra phanh & Gầm', '30A1234567', '2026-02-20', '09:15:00', 400000.00, 'Hoàn thành', 'Đã căn chỉnh lại phanh', NULL),
(5, 8, 'Thay Lốp', '24A12345', '2026-04-01', '15:30:00', 1000000.00, 'Hoàn thành', 'Thay lốp trước bên trái', NULL),
(6, 8, 'Cân bằng động bánh xe', '24A12345', '2026-04-01', '16:15:00', 300000.00, 'Hoàn thành', 'Làm cùng gói thay lốp', NULL),
(7, 7, 'Vệ sinh khoang máy', '23A1111', '2026-03-25', '08:00:00', 850000.00, 'Hoàn thành', 'Sử dụng hơi nước nóng', NULL),
(8, 8, 'Tẩy ố kính & Phủ Nano', '30A3333', '2026-04-14', '11:00:00', 600000.00, 'Hoàn thành', 'Kính lái và 2 kính hông', NULL),
(9, 29, 'Rửa Xe', '30Akasf', '2026-10-10', '12:00:00', NULL, 'Hoàn thành', NULL, NULL),
(10, 31, 'Vệ sinh khoang máy', '31A0912', '2026-04-23', '20:00:00', NULL, 'Hoàn thành', NULL, NULL),
(11, 36, 'Thay Lốp', '30A-123.45', '2026-04-23', '19:00:00', NULL, 'Hoàn thành', NULL, NULL),
(12, 37, 'Rửa Xe', '21A-123.45', '2026-04-23', '20:00:00', NULL, 'Hoàn thành', NULL, NULL),
(13, 37, 'Thay Lốp', '21A-123.45', '2026-04-23', '20:00:00', NULL, 'Hoàn thành', NULL, NULL),
(14, 37, 'Rửa xe chi tiết (Detailing)', '21A-123.45', '2026-04-23', '20:00:00', NULL, 'Hoàn thành', NULL, NULL),
(15, 37, 'Vệ sinh khoang máy', '21A-123.45', '2026-04-23', '20:00:00', NULL, 'Hoàn thành', NULL, NULL),
(16, 37, 'Tẩy ố kính & Phủ Nano', '21A-123.45', '2026-04-23', '20:00:00', 600000.00, 'Hoàn thành', NULL, 27),
(17, 37, 'Vệ sinh nội thất chuyên sâu', '21A-123.45', '2026-04-23', '20:00:00', 1500000.00, 'Hoàn thành', NULL, 28),
(18, 36, 'Rửa xe chi tiết (Detailing)', '30A-123.45', '2026-04-23', '19:00:00', 250000.00, 'Hoàn thành', NULL, 21),
(19, 36, 'Kiểm tra phanh & Gầm', '20A-123.11', '2026-04-24', '12:00:00', 400000.00, 'Hoàn thành', NULL, NULL),
(20, 36, 'Phủ Ceramic bảo vệ sơn', '20A-123.11', '2026-04-24', '12:00:00', 5500000.00, 'Hoàn thành', NULL, 39),
(21, 36, 'Rửa Xe', '20A-123.11', '2026-04-24', '12:00:00', 1000000.00, 'Hoàn thành', NULL, 32),
(22, 36, 'Thay Lốp', '20A-123.11', '2026-04-24', '12:00:00', 1000000.00, 'Hoàn thành', NULL, 33),
(23, 36, 'Rửa xe chi tiết (Detailing)', '20A-123.11', '2026-04-24', '12:00:00', 250000.00, 'Hoàn thành', NULL, 34),
(24, 36, 'Vệ sinh khoang máy', '20A-123.11', '2026-04-24', '12:00:00', 850000.00, 'Hoàn thành', NULL, 35),
(25, 36, 'Tẩy ố kính & Phủ Nano', '20A-123.11', '2026-04-24', '12:00:00', 600000.00, 'Hoàn thành', NULL, 36),
(26, 36, 'Vệ sinh nội thất chuyên sâu', '20A-123.11', '2026-04-24', '12:00:00', 1500000.00, 'Hoàn thành', NULL, 37),
(27, 36, 'Đánh bóng hiệu chỉnh sơn', '20A-123.11', '2026-04-24', '12:00:00', 2500000.00, 'Hoàn thành', NULL, 38),
(28, 36, 'Vệ sinh khoang máy', '30A-123.45', '2026-04-23', '19:00:00', 850000.00, 'Hoàn thành', NULL, 22),
(29, 44, 'Rửa Xe', '30A-1234.11', '2026-04-24', '20:00:00', 1000000.00, 'Hoàn thành', NULL, 44),
(30, 44, 'Thay Lốp', '30A-1234.11', '2026-04-24', '20:00:00', 1000000.00, 'Hoàn thành', NULL, 45),
(31, 44, 'Rửa xe chi tiết (Detailing)', '30A-1234.11', '2026-04-24', '20:00:00', 250000.00, 'Hoàn thành', NULL, 46),
(32, 44, 'Vệ sinh khoang máy', '30A-1234.11', '2026-04-24', '20:00:00', 850000.00, 'Hoàn thành', NULL, 47),
(33, 44, 'Tẩy ố kính & Phủ Nano', '30A-1234.11', '2026-04-24', '20:00:00', 600000.00, 'Hoàn thành', NULL, 48),
(34, 44, 'Vệ sinh nội thất chuyên sâu', '30A-1234.11', '2026-04-24', '20:00:00', 1500000.00, 'Hoàn thành', NULL, 49),
(35, 44, 'Rửa Xe', '19A-1233.44', '2026-04-24', '10:00:00', 1000000.00, 'Hoàn thành', NULL, 50),
(36, 44, 'Thay Lốp', '19A-1233.44', '2026-04-24', '10:00:00', 1000000.00, 'Hoàn thành', NULL, 51),
(37, 44, 'Rửa xe chi tiết (Detailing)', '19A-1233.44', '2026-04-24', '10:00:00', 250000.00, 'Hoàn thành', NULL, 52),
(38, 44, 'Vệ sinh khoang máy', '19A-1233.44', '2026-04-24', '10:00:00', 850000.00, 'Hoàn thành', NULL, 53),
(39, 44, 'Tẩy ố kính & Phủ Nano', '19A-1233.44', '2026-04-24', '10:00:00', 600000.00, 'Hoàn thành', NULL, 54),
(40, 44, 'Vệ sinh nội thất chuyên sâu', '19A-1233.44', '2026-04-24', '10:00:00', 1500000.00, 'Hoàn thành', NULL, 55);

-- --------------------------------------------------------

--
-- Cấu trúc bảng cho bảng `service_products`
--

CREATE TABLE `service_products` (
  `id` int(11) NOT NULL,
  `service_id` int(11) NOT NULL,
  `product_id` int(11) NOT NULL,
  `quantity_needed` int(11) DEFAULT 1,
  `is_required` tinyint(1) DEFAULT 1
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Đang đổ dữ liệu cho bảng `service_products`
--

INSERT INTO `service_products` (`id`, `service_id`, `product_id`, `quantity_needed`, `is_required`) VALUES
(1, 1, 1, 1, 1),
(2, 1, 9, 1, 1),
(3, 2, 9, 1, 1),
(4, 2, 20, 2, 1),
(5, 3, 2, 1, 1),
(7, 9, 1, 1, 1),
(8, 10, 3, 1, 1),
(10, 9, 12, 1, 1),
(12, 2, 4, 4, 1),
(13, 14, 1, 4, 1),
(14, 14, 12, 1, 1),
(15, 15, 3, 2, 1),
(16, 16, 8, 1, 1),
(17, 17, 13, 2, 1),
(18, 18, 2, 1, 1),
(19, 19, 10, 4, 1),
(20, 20, 7, 1, 1),
(21, 13, 1, 4, 1),
(22, 13, 12, 1, 1),
(23, 13, 10, 4, 1),
(24, 13, 2, 1, 1),
(25, 13, 13, 2, 1),
(26, 3, 6, 1, 1),
(27, 6, 6, 2, 1),
(28, 10, 19, 1, 1),
(29, 10, 17, 1, 1),
(31, 21, 11, 1, 1),
(32, 22, 5, 1, 1),
(33, 23, 16, 1, 1),
(34, 13, 15, 1, 1);

--
-- Chỉ mục cho các bảng đã đổ
--

--
-- Chỉ mục cho bảng `appointments`
--
ALTER TABLE `appointments`
  ADD PRIMARY KEY (`id`),
  ADD KEY `customer_id` (`customer_id`),
  ADD KEY `car_plate` (`car_plate`),
  ADD KEY `service_id` (`service_id`),
  ADD KEY `employee_id` (`employee_id`);

--
-- Chỉ mục cho bảng `appointment_materials`
--
ALTER TABLE `appointment_materials`
  ADD PRIMARY KEY (`id`),
  ADD KEY `appointment_id` (`appointment_id`),
  ADD KEY `service_id` (`service_id`),
  ADD KEY `product_id` (`product_id`);

--
-- Chỉ mục cho bảng `appointment_services`
--
ALTER TABLE `appointment_services`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `unique_appointment_service` (`appointment_id`,`service_id`),
  ADD KEY `service_id` (`service_id`);

--
-- Chỉ mục cho bảng `cars`
--
ALTER TABLE `cars`
  ADD PRIMARY KEY (`plate_number`),
  ADD KEY `customer_id` (`customer_id`);

--
-- Chỉ mục cho bảng `customers`
--
ALTER TABLE `customers`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `phone` (`phone`);

--
-- Chỉ mục cho bảng `employees`
--
ALTER TABLE `employees`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `employee_code` (`employee_code`),
  ADD UNIQUE KEY `employee_code_2` (`employee_code`),
  ADD UNIQUE KEY `phone` (`phone`),
  ADD UNIQUE KEY `cccd` (`cccd`);

--
-- Chỉ mục cho bảng `inventory`
--
ALTER TABLE `inventory`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `product_code` (`product_code`);

--
-- Chỉ mục cho bảng `invoices`
--
ALTER TABLE `invoices`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `appointment_id` (`appointment_id`),
  ADD KEY `customer_id` (`customer_id`);

--
-- Chỉ mục cho bảng `invoice_items`
--
ALTER TABLE `invoice_items`
  ADD PRIMARY KEY (`id`),
  ADD KEY `invoice_id` (`invoice_id`),
  ADD KEY `service_id` (`service_id`);

--
-- Chỉ mục cho bảng `invoice_products`
--
ALTER TABLE `invoice_products`
  ADD PRIMARY KEY (`id`),
  ADD KEY `invoice_id` (`invoice_id`),
  ADD KEY `product_id` (`product_id`);

--
-- Chỉ mục cho bảng `payments`
--
ALTER TABLE `payments`
  ADD PRIMARY KEY (`id`),
  ADD KEY `invoice_id` (`invoice_id`);

--
-- Chỉ mục cho bảng `services`
--
ALTER TABLE `services`
  ADD PRIMARY KEY (`id`);

--
-- Chỉ mục cho bảng `service_history`
--
ALTER TABLE `service_history`
  ADD PRIMARY KEY (`id`),
  ADD KEY `customer_id` (`customer_id`);

--
-- Chỉ mục cho bảng `service_products`
--
ALTER TABLE `service_products`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `unique_service_product` (`service_id`,`product_id`),
  ADD KEY `product_id` (`product_id`);

--
-- AUTO_INCREMENT cho các bảng đã đổ
--

--
-- AUTO_INCREMENT cho bảng `appointments`
--
ALTER TABLE `appointments`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=174;

--
-- AUTO_INCREMENT cho bảng `appointment_materials`
--
ALTER TABLE `appointment_materials`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=61;

--
-- AUTO_INCREMENT cho bảng `appointment_services`
--
ALTER TABLE `appointment_services`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=296;

--
-- AUTO_INCREMENT cho bảng `customers`
--
ALTER TABLE `customers`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=61;

--
-- AUTO_INCREMENT cho bảng `employees`
--
ALTER TABLE `employees`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=13;

--
-- AUTO_INCREMENT cho bảng `inventory`
--
ALTER TABLE `inventory`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=22;

--
-- AUTO_INCREMENT cho bảng `invoices`
--
ALTER TABLE `invoices`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=119;

--
-- AUTO_INCREMENT cho bảng `invoice_items`
--
ALTER TABLE `invoice_items`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=208;

--
-- AUTO_INCREMENT cho bảng `invoice_products`
--
ALTER TABLE `invoice_products`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=42;

--
-- AUTO_INCREMENT cho bảng `payments`
--
ALTER TABLE `payments`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=119;

--
-- AUTO_INCREMENT cho bảng `services`
--
ALTER TABLE `services`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=24;

--
-- AUTO_INCREMENT cho bảng `service_history`
--
ALTER TABLE `service_history`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=41;

--
-- AUTO_INCREMENT cho bảng `service_products`
--
ALTER TABLE `service_products`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=36;

--
-- Các ràng buộc cho các bảng đã đổ
--

--
-- Các ràng buộc cho bảng `appointments`
--
ALTER TABLE `appointments`
  ADD CONSTRAINT `appointments_ibfk_1` FOREIGN KEY (`customer_id`) REFERENCES `customers` (`id`),
  ADD CONSTRAINT `appointments_ibfk_2` FOREIGN KEY (`car_plate`) REFERENCES `cars` (`plate_number`),
  ADD CONSTRAINT `appointments_ibfk_3` FOREIGN KEY (`service_id`) REFERENCES `services` (`id`),
  ADD CONSTRAINT `appointments_ibfk_4` FOREIGN KEY (`employee_id`) REFERENCES `employees` (`id`);

--
-- Các ràng buộc cho bảng `appointment_materials`
--
ALTER TABLE `appointment_materials`
  ADD CONSTRAINT `appointment_materials_ibfk_1` FOREIGN KEY (`appointment_id`) REFERENCES `appointments` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `appointment_materials_ibfk_2` FOREIGN KEY (`service_id`) REFERENCES `services` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `appointment_materials_ibfk_3` FOREIGN KEY (`product_id`) REFERENCES `inventory` (`id`) ON DELETE CASCADE;

--
-- Các ràng buộc cho bảng `appointment_services`
--
ALTER TABLE `appointment_services`
  ADD CONSTRAINT `appointment_services_ibfk_1` FOREIGN KEY (`appointment_id`) REFERENCES `appointments` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `appointment_services_ibfk_2` FOREIGN KEY (`service_id`) REFERENCES `services` (`id`) ON DELETE CASCADE;

--
-- Các ràng buộc cho bảng `cars`
--
ALTER TABLE `cars`
  ADD CONSTRAINT `cars_ibfk_1` FOREIGN KEY (`customer_id`) REFERENCES `customers` (`id`) ON DELETE CASCADE;

--
-- Các ràng buộc cho bảng `invoices`
--
ALTER TABLE `invoices`
  ADD CONSTRAINT `invoices_ibfk_1` FOREIGN KEY (`appointment_id`) REFERENCES `appointments` (`id`) ON DELETE SET NULL,
  ADD CONSTRAINT `invoices_ibfk_2` FOREIGN KEY (`customer_id`) REFERENCES `customers` (`id`);

--
-- Các ràng buộc cho bảng `invoice_items`
--
ALTER TABLE `invoice_items`
  ADD CONSTRAINT `invoice_items_ibfk_1` FOREIGN KEY (`invoice_id`) REFERENCES `invoices` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `invoice_items_ibfk_2` FOREIGN KEY (`service_id`) REFERENCES `services` (`id`);

--
-- Các ràng buộc cho bảng `invoice_products`
--
ALTER TABLE `invoice_products`
  ADD CONSTRAINT `invoice_products_ibfk_1` FOREIGN KEY (`invoice_id`) REFERENCES `invoices` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `invoice_products_ibfk_2` FOREIGN KEY (`product_id`) REFERENCES `inventory` (`id`) ON DELETE CASCADE;

--
-- Các ràng buộc cho bảng `payments`
--
ALTER TABLE `payments`
  ADD CONSTRAINT `payments_ibfk_1` FOREIGN KEY (`invoice_id`) REFERENCES `invoices` (`id`) ON DELETE CASCADE;

--
-- Các ràng buộc cho bảng `service_history`
--
ALTER TABLE `service_history`
  ADD CONSTRAINT `service_history_ibfk_1` FOREIGN KEY (`customer_id`) REFERENCES `customers` (`id`);

--
-- Các ràng buộc cho bảng `service_products`
--
ALTER TABLE `service_products`
  ADD CONSTRAINT `service_products_ibfk_1` FOREIGN KEY (`service_id`) REFERENCES `services` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `service_products_ibfk_2` FOREIGN KEY (`product_id`) REFERENCES `inventory` (`id`) ON DELETE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
